{
    "name": [
        "Achillea millefolium",
        "Allium sativum",
        "Aloe vera",
        "Alpinia officinarum",
        "Angelica sinensis",
        "Apium graveolens",
        "Arctium lappa",
        "Artemisia absinthium",
        "Atropa belladonna",
        "Calendula officinalis",
        "Capsicum annuum & Capsicum frutescens",
        "Cassia senna",
        "Rumex crispus",
        "Chamomilla recutita",
        "Chrysanthemum x morifolium",
        "Cimicifuga racemosa",
        "Citrus limon",
        "Codonopsis pilosula",
        "Commiphora molmol",
        "Curcuma longa",
        "Dioscorea villosa",
        "Echinacea spp.",
        "Elettaria cardamomum",
        "Eleutherococcus senticosus",
        "Eucalyptus globulus",
        "Eugenia caryophyllata",
        "Filipendula ulmaria",
        "Gentiana lutea",
        "Ginkgo biloba",
        "Glycyrrhiza glabra",
        "Hamamelis virginiana",
        "Harpagophytum procumbens",
        "Humulus lupulus",
        "Hypericum perforatum",
        "Inula helenium",
        "Lavandula angustifolia",
        "Linum usitatissimum",
        "Melaleuca alternifolia",
        "Melissa officinalis",
        "Mentha x piperita",
        "Ocimum tenuiflorum",
        "Paeonia lactiflora",
        "Panax ginseng",
        "Passiflora incarnata",
        "Pelargonium sidoides",
        "Plantago spp.",
        "Rehmannia glutinosa",
        "Rheum palmatum",
        "Rhodiola rosea",
        "Rosmarinus officinalis",
        "Salix alba",
        "Salvia miltiorrhiza",
        "Salvia officinalis",
        "Sambucus nigra",
        "Schisandra chinensis",
        "Scutellaria baicalensis",
        "Scutellaria lateriflora",
        "Serenoa repens",
        "Symphytum officinale",
        "Tabebuia spp.",
        "Tanacetum parthenium",
        "Taraxacum officinale",
        "Thymus vulgaris",
        "Turnera diffusa",
        "Ulmus rubra",
        "Urtica dioica",
        "Vaccinium myrtillus",
        "Valeriana officinalis",
        "Verbena officinalis",
        "Viburnum opulus",
        "Vitex agnus-castus",
        "Withania somnifera",
        "Zanthoxylum americanum",
        "Zea mays",
        "Zingiber officinale",
        "Acacia catechu",
        "Aegle marmelos",
        "Agrimonia eupatoria",
        "Althaea officinalis",
        "Angelica archangelica",
        "Arnica montana",
        "Asparagus racemosus",
        "Avena sativa",
        "Ballota nigra",
        "Beta vulgaris",
        "Capsella bursa-pastoris",
        "Centaurea cyanus",
        "Cetraria islandica",
        "Dianthus superbus",
        "Erythraea centaurium",
        "Eupatorium perfoliatum",
        "Euphrasia spp.",
        "Fagopyrum esculentum",
        "Ferula gummosa",
        "Foeniculum vulgare",
        "Geranium maculatum",
        "Leonurus cardiaca",
        "Lippia citriodora",
        "Maranta arundinacea",
        "Melaleuca leucadendron",
        "Mentha haplocalyx",
        "Mentha pulegium",
        "Nepeta cataria",
        "Ocimum basilicum",
        "Olea europaea",
        "Pimpinella anisum",
        "Piper nigrum",
        "Plantago major",
        "Polygonum bistorta",
        "Populus x candicans",
        "Punica granatum",
        "Quercus robur",
        "Ranunculus ficaria",
        "Solidago virgaurea",
        "Stellaria media",
        "Swertia chirata",
        "Tamarindus indica",
        "Thuja occidentalis",
        "Tilia spp.",
        "Viola tricolor",
        "Lavandula officinalis",
        "Mentha spp",
        "Euphrasia officinalis",
        "Cinnamomum spp",
        "Barosma betulina",
        "Ligusticum wallachii",
        "Centella asiatica"
    ],
    "ids": [
        0,
        3,
        4,
        5,
        7,
        8,
        9,
        10,
        13,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        25,
        26,
        28,
        33,
        34,
        35,
        36,
        37,
        39,
        40,
        41,
        42,
        43,
        44,
        45,
        46,
        47,
        49,
        50,
        51,
        52,
        55,
        56,
        57,
        59,
        60,
        61,
        62,
        63,
        66,
        68,
        69,
        70,
        71,
        72,
        73,
        74,
        75,
        76,
        77,
        78,
        79,
        81,
        82,
        83,
        84,
        86,
        87,
        88,
        89,
        90,
        91,
        92,
        93,
        94,
        95,
        96,
        97,
        98,
        102,
        110,
        113,
        124,
        136,
        150,
        159,
        163,
        165,
        172,
        186,
        196,
        199,
        251,
        268,
        277,
        281,
        284,
        288,
        292,
        306,
        346,
        350,
        366,
        370,
        372,
        373,
        391,
        395,
        397,
        425,
        431,
        434,
        442,
        446,
        464,
        466,
        468,
        500,
        504,
        508,
        511,
        517,
        519,
        538,
        542,
        543,
        544,
        545,
        546,
        547,
        548
    ],
    "common_names": [
        "Yarrow",
        "Garlic",
        "Aloe",
        "Lesser Galangal",
        "Dong Quai",
        "Celery",
        "Burdock",
        "Wormwood",
        "Deadly Nightshade",
        "Marigold",
        "Chili Pepper, Cayenne Pepper",
        "Senna",
        "Yellow Dock",
        "German Chamomile",
        "Florist's Chrysanthemum",
        "Black Cohosh",
        "Lemon",
        "Dang Shen",
        "Myrrh",
        "Turmeric",
        "Wild Yam",
        "Echinacea",
        "Cardamom",
        "Siberian Ginseng",
        "Eucalyptus",
        "Clove",
        "Meadowsweet",
        "Gentian",
        "Ginkgo",
        "Licorice",
        "Witch Hazel",
        "Devil's Claw",
        "Hops",
        "St. John's Wort",
        "Elecampane",
        "Lavender",
        "Flaxseed",
        "Tea Tree",
        "Lemon Balm",
        "Peppermint",
        "Holy Basil",
        "Chinese Peony",
        "Asian ginseng, Korean ginseng",
        "Passionflower",
        "Umckaloabo",
        "Plantain",
        "Chinese foxglove, Sheng Di Huang",
        "Chinese rhubarb, Turkey rhubarb",
        "Golden root, Arctic root",
        "Rosemary",
        "White willow",
        "Red sage, Danshen",
        "Common sage",
        "Elderberry",
        "Schisandra, Five-flavor berry",
        "Baikal skullcap",
        "Skullcap",
        "Saw palmetto",
        "Comfrey",
        "Pau d'Arco, Lapacho",
        "Feverfew",
        "Dandelion",
        "Thyme",
        "Damiana",
        "Slippery elm",
        "Stinging nettle",
        "Bilberry",
        "Valerian",
        "Vervain",
        "Cramp bark",
        "Chaste tree, Vitex",
        "Ashwagandha",
        "Prickly ash",
        "Corn",
        "Ginger",
        "Black catechu",
        "Bael",
        "Agrimony",
        "Marshmallow",
        "Angelica",
        "Arnica",
        "Shatavari",
        "Oats",
        "Black Horehound",
        "Beetroot",
        "Shepherd's Purse",
        "Cornflower",
        "Iceland Moss",
        "Fringed Pink",
        "Centaury",
        "Boneset",
        "Eyebright",
        "Buckwheat",
        "Galbanum",
        "Fennel",
        "Wild Geranium",
        "Motherwort",
        "Lemon Verbena",
        "Arrowroot",
        "Cajeput",
        "Chinese Mint",
        "Pennyroyal",
        "Catnip",
        "Basil",
        "Olive",
        "Anise",
        "Black Pepper",
        "Plantain",
        "Bistort",
        "Balsam Poplar",
        "Pomegranate",
        "English Oak",
        "Lesser Celandine",
        "Goldenrod",
        "Chickweed",
        "Chirata",
        "Tamarind",
        "White Cedar",
        "Linden",
        "Heartsease",
        "Lavender",
        "Mint",
        "Eyebright",
        "Cinnamon",
        "Buchu",
        "Chuanxiong (Chinese lovage)",
        "Gotu kola"
    ],
    "local_indian_names": [
        "Gandana",
        "Lahsun",
        "Ghritkumari",
        "Kulanjan",
        "Chota Choorak",
        "Ajmoda",
        "Kuth",
        "Afsanteen",
        "Angurshi",
        "Genda",
        "Lal Mirch",
        "Sanay",
        "Chhota Palak",
        "Babunah",
        "Guldaudi",
        "Shyamkalra",
        "Nimbu",
        "Tangshen",
        "Guggul",
        "Haldi",
        "Ratalu (Marathi)",
        "Angustha (Sanskrit)",
        "Elaichi",
        "Siberiya Jinsenga",
        "Nilgiri",
        "Laung",
        "Meetha Chond",
        "Chiraita",
        "Ginkgo",
        "Mulethi",
        "Hamamelis",
        "Devil's Claw",
        "Hops",
        "Asvagandha",
        "Pushkara",
        "Lavender (English)",
        "Alsi",
        "Melaleuca",
        "Melissa",
        "Pudina",
        "Tulsi",
        "Peoni ",
        "Ashwagandha (similar usage in Ayurveda, but different plant)",
        "Krishna Kamal (Sanskrit)",
        "Pelargonium (no widely known Indian local name)",
        "Isabgol (Hindi), Plantago ovata is a specific type",
        "Madhuka (Sanskrit)",
        "Revand Chini (Hindi)",
        "Rhodiola (no widely known Indian local name)",
        "Rusmari (Hindi)",
        "Safed Beda (Hindi)",
        "Sage (Salvia) - local names vary",
        "Sefakuss (Hindi), Sefakus (Sanskrit)",
        "Kalaka Phal (Hindi)",
        "Schisandra (no widely known Indian local name)",
        "Baikal skullcap (no widely known Indian local name)",
        "Skullcap (no widely known Indian local name)",
        "Saw Palmetto (no widely known Indian local name)",
        "Kumari (Sanskrit, but this usually refers to Aloe, yet some regional overlap)",
        "Pau d'Arco (no widely known Indian local name)",
        "Feverfew (no widely known Indian local name)",
        "Kanphool (Hindi)",
        "Ajwain Ke Phool (Hindi)",
        "Damiana (no widely known Indian local name)",
        "Indian elm (no widely known Indian local name)",
        "Bichu Buti (Hindi)",
        "Neelabadari (Sanskrit)",
        "Tagara (Sanskrit)",
        "Vervain (no widely known Indian local name)",
        "Kulanjan (Hindi) - often a different species but similar use",
        "Nirgundi (Hindi, often refers to related species)",
        "Ashwagandha (Hindi)",
        "Tez-mulla (Hindi)",
        "Makka (Hindi)",
        "Adrak (Hindi)",
        "Khair (Hindi)",
        "Bilva (Sanskrit)",
        "Agrimony (no widely known Indian local name)",
        "Khatmi (Hindi)",
        "Chorak (Hindi)",
        "Arnica (no widely known Indian local name)",
        "Shatavari (Hindi)",
        "Jaee (Hindi)",
        "Kalmegh (Hindi)",
        "Chukandar (Hindi)",
        "Mastangi (Hindi)",
        "Neel Kanth (Hindi)",
        "Jharak (Hindi)",
        "Rajkeshari (Hindi)",
        "Maha-jhadi (Hindi)",
        "Bonset (Hindi)",
        "Chasmabhushan (Hindi)",
        "Kuttu (Hindi)",
        "Hinghastak (Hindi)",
        "Saunf (Hindi)",
        "Ranakarpur (Hindi)",
        "Brahmi (Hindi)",
        "Nimbu Tulsi (Hindi)",
        "Ararot (Hindi)",
        "Kayaputi (Hindi)",
        "Podina (Hindi)",
        "Pudina (Hindi)",
        "Kantipata (Hindi)",
        "Tulsi (Hindi)",
        "Jaitoon (Hindi)",
        "Saunf (Hindi)",
        "Kali Mirch (Hindi)",
        "Isabgol (Hindi)",
        "Anjabar (Hindi)",
        "Bhoj Patra (Hindi)",
        "Anar (Hindi)",
        "Pedh (Hindi)",
        "Swarnkeshari (Hindi)",
        "Pitari (Hindi)",
        "Madhumalti (Hindi)",
        "Chirayata (Hindi)",
        "Imli (Hindi)",
        "Meetha Bakayan (Hindi)",
        "Choti Lindi (Hindi)",
        "Ban Banslochan (Hindi)",
        "Lavangpushpa (Hindi)",
        "Pudina (Hindi)",
        "Jaldhania (Hindi)",
        "Dalchini (Hindi)",
        "Buchu (no widely known Indian local name)",
        "Chuanxiong (no widely known Indian local name)",
        "Mandukaparni (Sanskrit)"
    ],
    "description": [
        "Achillea millefolium, commonly known as yarrow, is a herbaceous plant often used for its anti-inflammatory and wound-healing properties.",
        "Allium sativum, commonly known as garlic, is a bulbous plant widely recognized for its antimicrobial, cardiovascular, and immune-boosting properties.",
        "Aloe vera is a succulent plant that stores water in its leaves. It is famous for its skin-soothing, wound-healing, and digestive-aid properties.",
        "Alpinia officinarum, or lesser galangal, is a perennial herb used primarily in traditional medicine for digestive complaints and inflammatory conditions.",
        "Angelica sinensis, or Dong Quai, is a well-known herb in traditional Chinese medicine used primarily for female reproductive health and blood circulation.",
        "Apium graveolens, or celery, is known both as a food and medicine, particularly for its anti-inflammatory, digestive, and diuretic properties.",
        "Arctium lappa, or burdock, is a biennial plant known for its detoxifying effects, used to treat skin conditions and as a blood purifier.",
        "Artemisia absinthium, commonly known as wormwood, is a perennial herb known for its bitter properties and its use in digestive disorders.",
        "Atropa belladonna, or deadly nightshade, is a highly toxic plant used in minute amounts for its anticholinergic properties.",
        "Calendula officinalis, or marigold, is known for its skin-healing properties and is used in treating wounds, rashes, and inflammation.",
        "Capsicum annuum and Capsicum frutescens are species of chili pepper widely used for their digestive, circulatory, and anti-inflammatory benefits.",
        "Cassia senna, or senna, is a well-known laxative used to relieve constipation.",
        "Rumex crispus, or yellow dock, is a herbaceous plant used for its detoxifying and mild laxative effects.",
        "Chamomilla recutita, also known as German chamomile, is a popular medicinal herb used for its calming, anti-inflammatory, and digestive properties.",
        "Chrysanthemum x morifolium is a hybrid species widely used in herbal medicine for its anti-inflammatory and detoxifying effects.",
        "Cimicifuga racemosa, or black cohosh, is traditionally used to relieve menopausal symptoms and menstrual disorders.",
        "Citrus limon, commonly known as lemon, is prized for its high vitamin C content and is used to treat a variety of ailments, including colds and digestive issues.",
        "Codonopsis pilosula, or Dang Shen, is an adaptogenic herb used in Traditional Chinese Medicine to boost energy and support the immune system.",
        "Commiphora molmol, or myrrh, is a resin used in traditional medicine for its antimicrobial, anti-inflammatory, and wound-healing properties.",
        "Curcuma longa, commonly known as turmeric, is a rhizome widely used in cooking and for its powerful anti-inflammatory effects.",
        "Dioscorea villosa, or wild yam, is a vine whose tuber is used for women's health, especially in menopause and menstrual disorders.",
        "Echinacea spp., commonly known as Echinacea, is a herb renowned for its immune-boosting properties.",
        "Elettaria cardamomum, or cardamom, is a fragrant spice known for its digestive benefits and antioxidant properties.",
        "Eleutherococcus senticosus, also called Siberian ginseng, is an adaptogenic herb used to enhance physical endurance and reduce stress.",
        "Eucalyptus globulus, commonly known as eucalyptus, is a tall evergreen tree used primarily for respiratory health and its antiseptic properties.",
        "Eugenia caryophyllata, or clove, is a spice used for its analgesic and antiseptic properties, particularly in dental care.",
        "Filipendula ulmaria, or meadowsweet, is a flowering plant used for its anti-inflammatory and pain-relieving properties.",
        "Gentiana lutea, commonly known as gentian, is a bitter herb used to stimulate digestion.",
        "Ginkgo biloba, or ginkgo, is an ancient tree species used to enhance cognitive function and improve circulation.",
        "Glycyrrhiza glabra, commonly known as licorice, is a root used for its soothing and anti-inflammatory properties, especially for the digestive and respiratory systems.",
        "Hamamelis virginiana, or witch hazel, is a shrub known for its astringent properties, commonly used in skincare for its soothing effects.",
        "Harpagophytum procumbens, commonly called Devil's Claw, is a herb known for its anti-inflammatory and pain-relieving effects, particularly for arthritis.",
        "Humulus lupulus, or hops, is a flowering plant known for its sedative properties, often used to support sleep and relaxation.",
        "Hypericum perforatum, or St. John's Wort, is a flowering plant widely used for its antidepressant and mood-stabilizing effects.",
        "Inula helenium, commonly known as elecampane, is a root herb used for its expectorant properties, particularly in respiratory conditions.",
        "Lavandula angustifolia, commonly known as lavender, is an aromatic herb used for its calming effects and in the treatment of anxiety, insomnia, and stress-related conditions.",
        "Linum usitatissimum, or flaxseed, is a herbaceous plant valued for its seeds, which are rich in omega-3 fatty acids and fiber, used for digestive health and cardiovascular support.",
        "Melaleuca alternifolia, known as tea tree, is a small tree or shrub, renowned for its potent antimicrobial and anti-inflammatory properties, particularly in skin infections.",
        "Melissa officinalis, or lemon balm, is a herbaceous plant with a lemon scent, commonly used to reduce stress, anxiety, and to improve sleep.",
        "Mentha x piperita, commonly known as peppermint, is a hybrid mint used for digestive issues, pain relief, and respiratory health.",
        "Ocimum tenuiflorum, known as holy basil, is a sacred plant in Indian culture, used to enhance immunity, reduce stress, and support respiratory health.",
        "Paeonia lactiflora, or Chinese peony, is a herbaceous plant used in traditional Chinese medicine for its anti-inflammatory, antispasmodic, and analgesic properties.",
        "Panax ginseng, a perennial plant in the Araliaceae family, is widely known for its adaptogenic properties and is often used to enhance physical stamina and mental performance.",
        "Passiflora incarnata, or passionflower, is a climbing vine with calming properties, traditionally used to treat anxiety and insomnia.",
        "Pelargonium sidoides, a flowering plant in the Geraniaceae family, is commonly used to treat respiratory infections due to its antimicrobial properties.",
        "Plantago spp. refers to a group of species known for their wound-healing and anti-inflammatory properties, often used in herbal medicine for digestive and respiratory issues.",
        "Rehmannia glutinosa, a key herb in Traditional Chinese Medicine, is used for its rejuvenating properties, particularly in supporting kidney and adrenal health.",
        "Rheum palmatum, commonly known as Chinese rhubarb, is used for its potent laxative and detoxifying properties.",
        "Rhodiola rosea, a perennial flowering plant, is known for its adaptogenic properties, helping to reduce fatigue and improve resilience to stress.",
        "Rosmarinus officinalis, or rosemary, is a fragrant herb widely used for its antioxidant and anti-inflammatory properties, particularly in improving memory and digestion.",
        "Salix alba, or white willow, is known for its analgesic and anti-inflammatory properties, often used as a natural alternative to aspirin.",
        "Salvia miltiorrhiza, also known as Danshen, is used in Traditional Chinese Medicine to improve cardiovascular health and treat circulation problems.",
        "Salvia officinalis, commonly known as sage, is a perennial, evergreen subshrub with grayish leaves and blue to purplish flowers. It is well known for its antimicrobial and anti-inflammatory properties.",
        "Sambucus nigra, or elderberry, is a flowering plant used traditionally to treat cold and flu symptoms due to its immune-boosting properties.",
        "Schisandra chinensis, known as the five-flavor berry, is a deciduous woody vine whose berries are used in Traditional Chinese Medicine for their adaptogenic and liver-protective properties.",
        "Scutellaria baicalensis, or Baikal skullcap, is a flowering plant used in Traditional Chinese Medicine for its potent anti-inflammatory and antioxidant properties.",
        "Scutellaria lateriflora, commonly known as skullcap, is a herbaceous perennial plant used for its calming and anxiolytic effects.",
        "Serenoa repens, or saw palmetto, is a small palm with berries that are commonly used to support prostate health and treat urinary conditions.",
        "Symphytum officinale, known as comfrey, is a perennial herb used externally for its wound-healing and anti-inflammatory properties.",
        "Tabebuia spp., commonly known as Pau d'Arco, is a tree native to Central and South America whose bark is used for its antimicrobial and anti-inflammatory properties.",
        "Tanacetum parthenium, or feverfew, is a flowering plant traditionally used to prevent migraines and treat inflammatory conditions.",
        "Taraxacum officinale, commonly known as dandelion, is a flowering plant used for its diuretic, liver-supporting, and digestive properties.",
        "Thymus vulgaris, commonly known as thyme, is an aromatic perennial herb with medicinal properties including antimicrobial, antioxidant, and anti-inflammatory effects.",
        "Turnera diffusa, or damiana, is a small shrub native to Central and South America, traditionally used as an aphrodisiac and for its mood-enhancing properties.",
        "Ulmus rubra, known as slippery elm, is a species of elm native to North America, valued for its mucilaginous bark, which is used to soothe the digestive tract.",
        "Urtica dioica, commonly known as stinging nettle, is a herbaceous perennial plant known for its anti-inflammatory, diuretic, and nutrient-rich properties.",
        "Vaccinium myrtillus, or bilberry, is a low-growing shrub native to Europe, valued for its antioxidant-rich berries that support eye health and circulation.",
        "Valeriana officinalis, commonly known as valerian, is a perennial flowering plant used for its sedative and anxiolytic effects, particularly in treating insomnia and anxiety.",
        "Verbena officinalis, or vervain, is a flowering plant traditionally used to treat headaches, insomnia, and depression due to its mild sedative and anti-anxiety properties.",
        "Viburnum opulus, known as cramp bark, is a deciduous shrub used to relieve muscle spasms and menstrual cramps.",
        "Vitex agnus-castus, commonly known as chaste tree or Vitex, is a small shrub used to balance hormones and alleviate symptoms of PMS and menopause.",
        "Withania somnifera, known as ashwagandha, is an important herb in Ayurveda, used for its adaptogenic properties to reduce stress, improve energy levels, and support overall well-being.",
        "Zanthoxylum americanum, known as prickly ash, is a small tree or shrub with medicinal bark and berries, used to stimulate circulation and relieve pain.",
        "Zea mays, commonly known as corn, is a staple crop with silk and oil used in herbal medicine for urinary and digestive health.",
        "Zingiber officinale, or ginger, is a rhizome widely used for its anti-inflammatory, digestive, and anti-nausea properties.",
        "Acacia catechu, known as black catechu, is a small tree whose heartwood extract is used for its astringent, anti-inflammatory, and antimicrobial properties.",
        "Aegle marmelos, commonly known as bael, is a tree valued for its fruit, which is used to treat digestive disorders and as a general tonic.",
        "Agrimonia eupatoria, or agrimony, is a perennial herb used for its astringent, anti-inflammatory, and digestive-supporting properties.",
        "Althaea officinalis, known as marshmallow, is a perennial herb with soothing mucilage used to treat respiratory and digestive irritation.",
        "Angelica archangelica, or angelica, is a tall biennial plant known for its aromatic roots and seeds used to stimulate digestion and relieve colds.",
        "Arnica montana, known as arnica, is a mountain herb famous for its use in treating bruises, sprains, and muscle pain topically.",
        "Asparagus racemosus, or shatavari, is a climbing plant widely used in Ayurveda to balance hormones, boost fertility, and support reproductive health.",
        "Avena sativa, or oats, is widely known for its use in nutrition as a whole grain and for its soothing properties in topical applications.",
        "Ballota nigra, commonly known as Black Horehound, is a member of the mint family traditionally used for digestive and respiratory conditions.",
        "Beta vulgaris, or beetroot, is cultivated for its edible root and leaves, which are rich in nutrients and have medicinal benefits.",
        "Capsella bursa-pastoris, also known as Shepherd's Purse, is a medicinal herb used primarily for its ability to reduce bleeding.",
        "Centaurea cyanus, or Cornflower, is a flowering plant traditionally used in herbal medicine for eye and skin conditions.",
        "Cetraria islandica, commonly known as Iceland Moss, is a lichen used for respiratory conditions and as a food source.",
        "Dianthus superbus, known as Fringed Pink, is an ornamental and medicinal plant valued for its diuretic and anti-inflammatory properties.",
        "Erythraea centaurium, or Centaury, is a small herb used in traditional medicine for digestive disorders.",
        "Eupatorium perfoliatum, commonly known as Boneset, is a herb historically used for treating fevers and flu symptoms.",
        "Euphrasia spp., or Eyebright, is a genus of plants traditionally used to treat eye infections and inflammations.",
        "Fagopyrum esculentum, commonly known as Buckwheat, is a gluten-free grain-like seed rich in fiber and essential nutrients.",
        "Ferula gummosa, or Galbanum, is a gum-resin traditionally used for its antimicrobial and anti-inflammatory properties.",
        "Foeniculum vulgare, known as Fennel, is a flavorful herb used for digestive issues and respiratory disorders.",
        "Geranium maculatum, or Wild Geranium, is a North American plant used for its astringent and anti-inflammatory properties.",
        "Leonurus cardiaca, known as Motherwort, is an herb traditionally used to support heart and menstrual health.",
        "Lippia citriodora, or Lemon Verbena, is an aromatic plant used for its digestive and calming effects.",
        "Maranta arundinacea, commonly known as Arrowroot, is a starchy tuber used for digestive health and as a thickening agent.",
        "Melaleuca leucadendron, or Cajeput, is a tree native to Southeast Asia, valued for its essential oil with antiseptic and analgesic properties.",
        "Mentha haplocalyx, or Chinese Mint, is used in traditional medicine for digestive and respiratory conditions.",
        "Mentha pulegium, commonly known as Pennyroyal, is a mint plant used historically for its carminative and insect-repelling properties.",
        "Nepeta cataria, commonly known as Catnip, is an herb that induces euphoria in cats and is used in herbal medicine for its calming effects.",
        "Ocimum basilicum, or Basil, is a popular aromatic herb known for its culinary uses and medicinal benefits for digestion and inflammation.",
        "Olea europaea, the Olive tree, is valued for its fruit and oil, which have antioxidant and cardiovascular benefits.",
        "Pimpinella anisum, known as Anise, is a flowering plant used for its seeds' licorice-like flavor and digestive benefits.",
        "Piper nigrum, or Black Pepper, is a widely used spice with antibacterial, antioxidant, and digestive benefits.",
        "Plantago major, commonly called Plantain, is a herb used traditionally for its anti-inflammatory and wound-healing properties.",
        "Polygonum bistorta, or Bistort, is a herb with strong astringent properties, often used to treat gastrointestinal disorders.",
        "Populus x candicans, or Balsam Poplar, is a hybrid tree valued for its resin, used in treating respiratory and skin ailments.",
        "Punica granatum, or Pomegranate, is a fruit-bearing shrub known for its high antioxidant content and cardiovascular benefits.",
        "Quercus robur, or English Oak, is a large tree with bark used traditionally for its astringent and anti-inflammatory properties.",
        "Ranunculus ficaria, known as Lesser Celandine, is a perennial plant used traditionally for treating hemorrhoids and varicose veins.",
        "Solidago virgaurea, or Goldenrod, is a flowering plant used in herbal medicine for its diuretic and anti-inflammatory properties.",
        "Stellaria media, known as Chickweed, is a common edible herb with soothing properties used to treat skin irritations and respiratory issues.",
        "Swertia chirata, commonly called Chirata, is an important herb in Ayurveda known for its bitter tonic and anti-malarial properties.",
        "Tamarindus indica, or Tamarind, is a tropical tree known for its fruit, which is used for digestive and anti-inflammatory purposes.",
        "Thuja occidentalis, or White Cedar, is an evergreen tree used traditionally for respiratory and immune system support.",
        "Tilia spp., commonly called Linden, is a tree whose flowers are used in herbal medicine for their calming and anti-inflammatory effects.",
        "Viola tricolor, or Heartsease, is a small herbaceous plant used for its skin-healing, anti-inflammatory, and diuretic properties.",
        "Lavandula officinalis, or Lavender, is a well-known aromatic herb used for calming, sleep aid, and anti-inflammatory purposes.",
        "Mentha spp., or Mint, is a genus of aromatic herbs used widely for digestive, respiratory, and calming effects.",
        "Euphrasia officinalis, commonly known as eyebright, is a small herb traditionally used to treat eye conditions and respiratory issues.",
        "Cinnamomum spp, or cinnamon, is a genus of aromatic trees and shrubs whose bark is widely used as a spice and in traditional medicine for its warming properties.",
        "Barosma betulina, known as buchu, is a small shrub native to South Africa, used for its diuretic and antiseptic properties, particularly in urinary tract conditions.",
        "Ligusticum wallachii, or Chuanxiong, is a perennial herb used in traditional Chinese medicine for its ability to invigorate blood circulation and relieve pain.",
        "Centella asiatica, commonly known as gotu kola, is a herbaceous plant used in Ayurvedic and traditional medicine for its cognitive-enhancing, wound-healing, and anti-inflammatory properties."
    ],
    "key_actions": [
        "Anti-inflammatory, hemostatic, antiseptic, diaphoretic",
        "Antimicrobial, cardioprotective, anti-inflammatory, antithrombotic",
        "Wound healing, moisturizing, anti-inflammatory, laxative",
        "Stimulant, carminative, digestive aid, anti-inflammatory",
        "Blood tonic, emmenagogue, anti-inflammatory, anti-spasmodic",
        "Anti-inflammatory, diuretic, carminative",
        "Blood purifier, diuretic, anti-inflammatory, detoxifying",
        "Anthelmintic, digestive stimulant, antimicrobial, bitter tonic",
        "Anticholinergic, analgesic, sedative, spasmolytic",
        "Anti-inflammatory, vulnerary, antiseptic",
        "Circulatory stimulant, digestive stimulant, anti-inflammatory",
        "Laxative, cathartic, purgative",
        "Detoxifying, mild laxative, anti-inflammatory",
        "Calming, anti-inflammatory, digestive aid",
        "Anti-inflammatory, detoxifying, immune-boosting",
        "Hormonal balancing, anti-inflammatory, analgesic",
        "Antioxidant, immune-boosting, digestive aid",
        "Adaptogenic, immune-boosting, energy-enhancing",
        "Antimicrobial, anti-inflammatory, wound-healing",
        "Anti-inflammatory, antioxidant, antimicrobial",
        "Antispasmodic, anti-inflammatory, estrogenic",
        "Immunostimulant, anti-inflammatory, antiviral",
        "Carminative, antioxidant, diuretic",
        "Adaptogenic, immune-enhancing, stress-reducing",
        "Expectorant, antiseptic, anti-inflammatory",
        "Analgesic, antiseptic, carminative",
        "Anti-inflammatory, analgesic, antacid",
        "Bitter tonic, digestive stimulant, anti-inflammatory",
        "Cognitive enhancer, circulatory stimulant, antioxidant",
        "Anti-inflammatory, demulcent, expectorant",
        "Astringent, anti-inflammatory, hemostatic",
        "Anti-inflammatory, analgesic, antirheumatic",
        "Sedative, antispasmodic, bitter tonic",
        "Antidepressant, antiviral, anti-inflammatory",
        "Expectorant, antimicrobial, diaphoretic",
        "Calming, anti-anxiety, sedative, analgesic",
        "Anti-inflammatory, cardiovascular support, laxative",
        "Antimicrobial, antifungal, anti-inflammatory",
        "Calming, antiviral, anti-anxiety, sedative",
        "Digestive aid, antispasmodic, decongestant, analgesic",
        "Adaptogenic, anti-inflammatory, antimicrobial",
        "Anti-inflammatory, antispasmodic, analgesic",
        "Adaptogen, immune stimulant, anti-fatigue",
        "Anxiolytic, sedative, antispasmodic",
        "Antimicrobial, immune modulator, expectorant",
        "Anti-inflammatory, demulcent, wound healing",
        "Adaptogen, anti-inflammatory, kidney tonic",
        "Laxative, astringent, detoxifying",
        "Adaptogen, anti-fatigue, cognitive enhancer",
        "Antioxidant, anti-inflammatory, memory enhancer",
        "Analgesic, anti-inflammatory, antipyretic",
        "Cardioprotective, blood circulation enhancer, antioxidant",
        "Antimicrobial, anti-inflammatory, antioxidant",
        "Immune stimulant, antiviral, anti-inflammatory",
        "Adaptogen, hepatoprotective, antioxidant",
        "Anti-inflammatory, antioxidant, neuroprotective",
        "Anxiolytic, sedative, anticonvulsant",
        "Anti-inflammatory, anti-androgenic, urinary antiseptic",
        "Wound healing, anti-inflammatory, demulcent",
        "Antimicrobial, anti-inflammatory, immune stimulant",
        "Anti-inflammatory, antipyretic, migraine preventative",
        "Diuretic, liver tonic, digestive stimulant",
        "Antimicrobial, antioxidant, anti-inflammatory",
        "Aphrodisiac, mood-enhancer, nervous system tonic",
        "Demulcent, anti-inflammatory, soothing",
        "Anti-inflammatory, diuretic, nutrient-rich",
        "Antioxidant, anti-inflammatory, circulatory tonic",
        "Sedative, anxiolytic, muscle relaxant",
        "Sedative, anti-anxiety, antidepressant",
        "Antispasmodic, muscle relaxant, anti-inflammatory",
        "Hormone balancer, anti-inflammatory, PMS and menopause support",
        "Adaptogen, anti-inflammatory, rejuvenative",
        "Circulatory stimulant, analgesic, anti-inflammatory",
        "Diuretic, demulcent, anti-inflammatory",
        "Anti-inflammatory, digestive aid, anti-nausea",
        "Astringent, anti-inflammatory, antimicrobial",
        "Digestive tonic, anti-inflammatory, antidiarrheal",
        "Astringent, anti-inflammatory, digestive tonic",
        "Demulcent, anti-inflammatory, soothing",
        "Digestive stimulant, carminative, expectorant",
        "Anti-inflammatory, analgesic, circulatory stimulant (topical use)",
        "Adaptogen, hormone balancer, rejuvenative",
        "Nourishing, anti-inflammatory, emollient",
        "Antispasmodic, sedative, digestive tonic",
        "Hepatoprotective, antioxidant, anti-inflammatory",
        "Astringent, styptic, diuretic",
        "Anti-inflammatory, astringent, antioxidant",
        "Demulcent, expectorant, nutritive",
        "Diuretic, anti-inflammatory, tonic",
        "Digestive stimulant, bitter tonic, anti-inflammatory",
        "Antipyretic, diaphoretic, immune stimulant",
        "Anti-inflammatory, astringent, tonic for eyes",
        "Nutritional, anti-inflammatory, antioxidant",
        "Antimicrobial, anti-inflammatory, expectorant",
        "Carminative, expectorant, digestive tonic",
        "Astringent, anti-inflammatory, hemostatic",
        "Cardiotonic, sedative, antispasmodic",
        "Digestive, sedative, antioxidant",
        "Demulcent, anti-diarrheal, digestive aid",
        "Antiseptic, analgesic, expectorant",
        "Carminative, digestive tonic, antispasmodic",
        "Carminative, emmenagogue, insect repellent",
        "Calming, sedative, digestive aid",
        "Antibacterial, anti-inflammatory, digestive",
        "Antioxidant, anti-inflammatory, cardioprotective",
        "Carminative, expectorant, digestive aid",
        "Antibacterial, antioxidant, carminative",
        "Anti-inflammatory, wound-healing, demulcent",
        "Astringent, anti-inflammatory, hemostatic",
        "Anti-inflammatory, expectorant, antimicrobial",
        "Antioxidant, anti-inflammatory, astringent",
        "Astringent, anti-inflammatory, tonic",
        "Anti-inflammatory, astringent, venotonic",
        "Diuretic, anti-inflammatory, antimicrobial",
        "Anti-inflammatory, demulcent, expectorant",
        "Antimalarial, bitter tonic, digestive aid",
        "Laxative, digestive aid, anti-inflammatory",
        "Antiviral, expectorant, immune stimulant",
        "Sedative, anti-inflammatory, antispasmodic",
        "Anti-inflammatory, diuretic, expectorant",
        "Calming, anti-inflammatory, antiseptic",
        "Carminative, antispasmodic, cooling",
        "Anti-inflammatory, astringent, decongestant",
        "Warming, anti-inflammatory, antimicrobial, antispasmodic",
        "Diuretic, antiseptic, anti-inflammatory",
        "Blood circulation stimulant, analgesic, anti-inflammatory",
        "Cognitive enhancer, wound healer, anti-inflammatory, adaptogen"
    ],
    "key_constituents": [
        "Flavonoids, tannins, alkaloids, essential oils",
        "Allicin, sulfur compounds, flavonoids",
        "Polysaccharides, anthraquinones, enzymes, vitamin A, vitamin C, vitamin E",
        "Galangin, flavonoids, essential oils",
        "Ligustilide, ferulic acid, polysaccharides",
        "Phthalides, flavonoids, volatile oils",
        "Inulin, polyacetylenes, lignans, tannins",
        "Thujone, absinthin, flavonoids",
        "Atropine, scopolamine, hyoscyamine",
        "Triterpenoids, flavonoids, essential oils",
        "Capsaicin, carotenoids, flavonoids",
        "Sennosides, anthraquinones, flavonoids",
        "Anthraquinones, tannins, oxalates",
        "Bisabolol, chamazulene, flavonoids",
        "Flavonoids, sesquiterpenes, vitamin A, vitamin C",
        "Triterpene glycosides, isoflavones, alkaloids",
        "Vitamin C, limonene, citric acid",
        "Polysaccharides, saponins, alkaloids",
        "Terpenoids, sesquiterpenes, essential oils",
        "Curcuminoids, volatile oils, polysaccharides",
        "Diosgenin, tannins, alkaloids",
        "Alkamides, polysaccharides, caffeic acid derivatives",
        "Volatile oils, flavonoids, phenolic compounds",
        "Eleutherosides, polysaccharides, flavonoids",
        "Eucalyptol, flavonoids, tannins",
        "Eugenol, tannins, flavonoids",
        "Salicylates, tannins, flavonoids",
        "Gentiopicroside, amarogentin, alkaloids",
        "Flavonoids, terpenoids, ginkgolides",
        "Glycyrrhizin, flavonoids, saponins",
        "Tannins, flavonoids, volatile oils",
        "Harpagoside, iridoid glycosides, phenolic acids",
        "Humulones, lupulones, essential oils",
        "Hypericin, hyperforin, flavonoids",
        "Inulin, sesquiterpene lactones, alantolactone",
        "Essential oils (linalool, linalyl acetate), tannins, coumarins",
        "Omega-3 fatty acids, lignans, fiber",
        "Terpinen-4-ol, cineole, alpha-pinene",
        "Volatile oils (citral, citronellal), flavonoids, polyphenols",
        "Menthol, menthone, flavonoids",
        "Eugenol, ursolic acid, rosmarinic acid",
        "Paeoniflorin, flavonoids, tannins",
        "Ginsenosides, polysaccharides, polyacetylenes",
        "Flavonoids, alkaloids, glycosides",
        "Umckalin, coumarins, tannins",
        "Mucilage, iridoid glycosides, tannins",
        "Iridoid glycosides, phenethyl alcohol glycosides, flavonoids",
        "Anthraquinones, tannins, calcium oxalate",
        "Rosavins, salidroside, flavonoids",
        "Rosmarinic acid, essential oils, diterpenes",
        "Salicin, flavonoids, tannins",
        "Tanshinones, salvianolic acids, diterpenoids",
        "Essential oils, rosmarinic acid, flavonoids",
        "Anthocyanins, flavonoids, vitamin A, vitamin C",
        "Schisandrin, schisandrol, lignans",
        "Baicalin, baicalein, wogonin",
        "Flavonoids, tannins, volatile oils",
        "Fatty acids, phytosterols, polysaccharides",
        "Allantoin, mucilage, tannins",
        "Lapachol, beta-lapachone, quercetin",
        "Parthenolide, flavonoids, volatile oils",
        "Taraxasterol, inulin, sesquiterpene lactones",
        "Essential oils (thymol, carvacrol), flavonoids, tannins",
        "Flavonoids, alkaloids, terpenoids",
        "Mucilage, tannins, flavonoids",
        "Flavonoids, vitamin A, vitamin C, minerals (iron, calcium)",
        "Anthocyanins, flavonoids, vitamin C, vitamin E",
        "Valerenic acid, isovaleric acid, flavonoids",
        "Iridoid glycosides (verbenalin), flavonoids, tannins",
        "Coumarins, salicin, tannins",
        "Flavonoids, iridoid glycosides, essential oils",
        "Withanolides, alkaloids, saponins",
        "Alkaloids, tannins, coumarins",
        "Flavonoids, vitamin C, vitamin K, allantoin",
        "Gingerols, shogaols, volatile oils",
        "Catechins, tannins, flavonoids",
        "Coumarins, alkaloids, tannins, pectin",
        "Tannins, flavonoids, essential oils",
        "Mucilage, flavonoids, pectin",
        "Essential oils, coumarins, bitter principles",
        "Sesquiterpene lactones, flavonoids, essential oils",
        "Steroidal saponins (shatavarins), alkaloids, flavonoids",
        "Beta-glucans, avenanthramides, saponins",
        "Diterpenes, phenolic compounds, volatile oils",
        "Betalains, flavonoids, nitrates",
        "Flavonoids, tannins, sulfur-containing compounds",
        "Anthocyanins, flavonoids, polyphenols",
        "Polysaccharides, lichen acids, usnic acid",
        "Saponins, flavonoids, anthocyanins",
        "Gentianine, flavonoids, secoiridoid glycosides",
        "Flavonoids, sesquiterpene lactones, polysaccharides",
        "Iridoid glycosides, tannins, flavonoids",
        "Rutin, quercetin, fiber, protein",
        "Resins, essential oils, ferulic acid",
        "Anethole, flavonoids, coumarins",
        "Tannins, gallic acid, flavonoids",
        "Alkaloids, flavonoids, iridoids",
        "Citral, verbascoside, flavonoids",
        "Starch, fiber, vitamin B, vitamin C",
        "Eucalyptol, cineole, terpineol",
        "Menthol, limonene, rosmarinic acid",
        "Pulegone, menthone, tannins",
        "Nepetalactone, tannins, volatile oils",
        "Eugenol, flavonoids, essential oils",
        "Oleuropein, hydroxytyrosol, fatty acids",
        "Anethole, estragole, flavonoids",
        "Piperine, volatile oils, alkaloids",
        "Allantoin, flavonoids, mucilage",
        "Tannins, flavonoids, oxalic acid",
        "Salicin, tannins, volatile oils",
        "Punicalagins, ellagic acid, flavonoids",
        "Tannins, triterpenes, flavonoids",
        "Saponins, flavonoids, tannins",
        "Saponins, flavonoids, essential oils",
        "Saponins, vitamin A, vitamin C, mucilage",
        "Bitter glycosides, alkaloids, flavonoids",
        "Tartaric acid, potassium, flavonoids",
        "Thujone, essential oils, polysaccharides",
        "Flavonoids, mucilage, volatile oils",
        "Flavonoids, salicylic acid, mucilage",
        "Linalool, cineole, coumarins",
        "Menthol, menthone, flavonoids",
        "Flavonoids, tannins, iridoid glycosides",
        "Cinnamaldehyde, eugenol, cinnamic acid, tannins",
        "Diosmin, flavonoids, volatile oils",
        "Ligustilide, ferulic acid, essential oils",
        "Triterpenoids (asiaticoside), flavonoids, alkaloids"
    ],
    "harvest_conditions": [
        "Harvest leaves and flowers in summer when fully bloomed.",
        "Bulbs are best harvested in late summer when the tops begin to die down.",
        "Leaves can be harvested year-round; for gel, choose mature leaves.",
        "Rhizomes are harvested in autumn.",
        "Roots are harvested in late autumn for medicinal use.",
        "Stalks are harvested in summer for culinary and medicinal use.",
        "Roots are harvested in the first year of growth during autumn.",
        "Harvest leaves and flowers in summer before flowering.",
        "Leaves and roots are harvested in autumn.",
        "Flowers are harvested in full bloom during summer.",
        "Fruits are harvested when fully ripe in late summer.",
        "Leaves and pods are harvested in summer.",
        "Roots are harvested in late autumn or early winter.",
        "Flowers are harvested in full bloom during summer.",
        "Flowers are harvested in autumn when fully mature.",
        "Roots are harvested in autumn after the plant has matured.",
        "Fruits are harvested when fully ripe in summer or autumn.",
        "Roots are harvested in autumn after the plant has matured.",
        "Resin is harvested from the bark of mature trees.",
        "Harvest rhizomes in autumn after the plant has matured.",
        "Harvest roots in autumn when the plant has matured.",
        "Harvest flowers and roots in autumn when fully matured.",
        "Harvest pods when fully matured in autumn.",
        "Harvest roots in autumn when the plant has matured.",
        "Harvest leaves and bark in autumn when fully matured.",
        "Harvest flower buds in autumn, just before they bloom.",
        "Harvest flowers and leaves in late spring or early summer.",
        "Harvest roots in autumn when the plant has fully matured.",
        "Harvest leaves in late summer or early autumn when fully matured.",
        "Harvest roots in autumn after the plant has matured.",
        "Harvest leaves and bark in autumn when fully matured.",
        "Harvest roots in autumn when the plant has fully matured.",
        "Harvest flowers in summer when fully bloomed.",
        "Harvest flowers in summer when fully bloomed.",
        "Harvest roots in autumn when the plant has fully matured.",
        "Harvest flowers in summer when fully bloomed.",
        "Harvest seeds when fully ripened in late summer or early autumn.",
        "Harvest leaves in late summer when fully matured.",
        "Harvest leaves in summer when fully matured.",
        "Harvest leaves in summer when fully matured.",
        "Harvest leaves in summer when fully matured.",
        "Harvest roots in autumn when the plant has fully matured.",
        "Harvest roots in autumn after 4-6 years of growth for maximum potency.",
        "Harvest aerial parts (leaves and flowers) in mid-summer when flowers are in full bloom.",
        "Harvest roots in autumn for medicinal use; aerial parts can be harvested in summer.",
        "Harvest leaves before flowering for medicinal use; seeds can be harvested in late summer.",
        "Harvest roots in autumn after 2-3 years of growth for optimal medicinal properties.",
        "Harvest roots in late summer or autumn when fully mature for maximum potency.",
        "Harvest roots in autumn after 3-5 years of growth for optimal medicinal properties.",
        "Harvest leaves and flowers in spring or early summer when aromatic oils are at their peak.",
        "Harvest bark in spring when sap is rising; leaves can be harvested in late spring or early summer.",
        "Harvest roots in autumn for medicinal use; aerial parts can be harvested in summer.",
        "Harvest leaves before flowering for medicinal use; cut stems to encourage bushy growth.",
        "Harvest berries in late summer or early autumn when fully ripe; flowers can be harvested in spring.",
        "Harvest berries in autumn when fully ripe; leaves can be harvested in late summer.",
        "Harvest roots in autumn after 3-4 years of growth for optimal medicinal properties.",
        "Harvest aerial parts (leaves and flowers) in mid-summer when flowers are in full bloom.",
        "Harvest berries in autumn for medicinal use; leaves can be harvested in late summer.",
        "Harvest leaves and roots in late spring or early summer for medicinal use.",
        "Harvest bark in spring when sap is rising; flowers can be harvested in summer.",
        "Harvest leaves and flowers in mid-summer when flowers are in full bloom.",
        "Harvest leaves before flowering for medicinal use; roots can be harvested in autumn.",
        "Harvest leaves before flowering for medicinal use; cut stems to encourage bushy growth.",
        "Harvest leaves and stems in summer when plant is in full bloom.",
        "Harvest inner bark in spring or autumn when sap is rising; avoid damaging the tree.",
        "Harvest leaves before flowering for medicinal use; roots can be harvested in autumn.",
        "Harvest berries in late summer or early autumn when fully ripe.",
        "Harvest roots in autumn after 2-3 years of growth for optimal medicinal properties.",
        "Harvest aerial parts (leaves and flowers) in mid-summer when flowers are in full bloom.",
        "Harvest bark in spring when sap is rising; berries can be harvested in autumn.",
        "Harvest berries in autumn when fully ripe; leaves can be harvested in late summer.",
        "Harvest roots in autumn after 3-4 years of growth for optimal medicinal properties.",
        "Harvest bark and berries in late summer; handle with care due to thorns.",
        "Harvest corn silk before pollination; kernels can be harvested when fully ripe.",
        "Harvest rhizomes in autumn after the leaves have died back for optimal medicinal properties.",
        "Harvest heartwood in autumn; avoid overharvesting to preserve the tree.",
        "Harvest fruit in late summer or autumn when fully ripe.",
        "Harvest aerial parts in summer when the plant is in full bloom.",
        "Harvest roots in autumn after the plant has flowered; leaves can be harvested in early summer.",
        "Harvest roots in late summer or early autumn; seeds can be harvested in late autumn.",
        "Harvest flowers in mid-summer when fully bloomed; handle with care.",
        "Harvest roots in autumn after 2-3 years of growth for optimal medicinal properties.",
        "Harvest oats in late summer when the grains are mature and the straw is still green.",
        "Harvest aerial parts in late summer when the plant is in full bloom.",
        "Harvest roots in late summer or early fall when fully mature.",
        "Harvest aerial parts just before or during flowering in spring and summer.",
        "Harvest flowers in late spring to early summer when in full bloom.",
        "Harvest the lichen in late summer; dry and store in a cool place.",
        "Harvest flowers in early to mid-summer when in full bloom.",
        "Harvest aerial parts in mid-summer when the plant is in full bloom.",
        "Harvest leaves and flowers in mid to late summer for medicinal use.",
        "Harvest the entire plant in summer, particularly when flowering for medicinal use.",
        "Harvest seeds in late summer when the plant has matured and seeds have dried.",
        "Harvest the gum-resin in late summer when the plant is fully mature.",
        "Harvest seeds in late summer or early fall when they are fully ripened.",
        "Harvest roots in early spring or late fall; aerial parts can be harvested in summer.",
        "Harvest aerial parts just before or during flowering in summer.",
        "Harvest leaves before flowering in summer; flowers can also be harvested for medicinal use.",
        "Harvest roots in late summer or early fall when the plant has fully matured.",
        "Harvest leaves and twigs in summer; essential oil is extracted from fresh plant material.",
        "Harvest leaves before the plant flowers for maximum potency.",
        "Harvest aerial parts in late summer when in full bloom.",
        "Harvest leaves and flowers in summer when in full bloom.",
        "Harvest leaves before flowering in summer for best flavor.",
        "Harvest olives in late fall or early winter when fully ripened.",
        "Harvest seeds in late summer when fully matured.",
        "Harvest berries when they turn black and are fully ripe.",
        "Harvest leaves and seeds in summer for medicinal use.",
        "Harvest roots in early spring or late fall for medicinal purposes.",
        "Harvest buds and resin in spring for medicinal use.",
        "Harvest fruit in fall when fully ripe; flowers can be harvested in summer.",
        "Harvest bark in spring or early summer for medicinal use.",
        "Harvest leaves and flowers in spring for medicinal use.",
        "Harvest aerial parts in late summer when flowers are in bloom.",
        "Harvest leaves and stems in spring or early summer.",
        "Harvest whole plant in late summer or early fall for medicinal use.",
        "Harvest fruit in late summer when fully ripe.",
        "Harvest leaves and twigs in spring or early summer for medicinal use.",
        "Harvest flowers in summer when fully bloomed.",
        "Harvest flowers and leaves in late spring or early summer.",
        "Harvest flowers in summer for essential oils and medicinal use.",
        "Harvest leaves throughout the growing season for medicinal use.",
        "Harvest aerial parts in late summer when flowers are in full bloom; dry quickly to preserve medicinal properties.",
        "Harvest bark in late autumn or winter when the tree is dormant; dry and store in a cool, dry place.",
        "Harvest leaves in summer when the plant is in full bloom; handle with care to preserve essential oils.",
        "Harvest roots in autumn after 2-3 years of growth; clean and dry thoroughly before use.",
        "Harvest leaves and stems in summer when the plant is in full bloom; roots can be harvested in autumn."
    ],
    "research_on_medicinal_properties": [
        "Studies suggest yarrow has significant anti-inflammatory and wound-healing effects, due to its flavonoid content.",
        "Extensive research confirms garlic's cardiovascular benefits, including reducing blood pressure and cholesterol levels.",
        "Aloe vera has been researched for its skin healing, moisturizing, and anti-inflammatory properties, particularly in burn treatment.",
        "Lesser galangal shows promise in its anti-inflammatory and antioxidant properties, though more clinical studies are required.",
        "Angelica sinensis is widely studied for its role in regulating menstruation and improving blood flow in traditional Chinese medicine.",
        "Celery has been found to exhibit anti-inflammatory and antihypertensive effects in animal studies.",
        "Burdock root has been shown to possess strong antioxidant properties and has been traditionally used for detoxification.",
        "Research shows wormwood has antiparasitic effects and may support digestive health by stimulating bile production.",
        "Atropa belladonna's alkaloids have been studied for their anticholinergic effects, which are useful in treating muscle spasms and certain types of poisoning.",
        "Calendula extracts have been researched for their skin-healing properties and ability to reduce inflammation in wounds and rashes.",
        "Capsaicin from chili peppers has been widely studied for its pain-relieving, anti-inflammatory, and digestive stimulant effects.",
        "Senna is well-known for its proven efficacy as a short-term treatment for constipation, with its active compounds being anthraquinones.",
        "Research on yellow dock has highlighted its use as a mild laxative and its potential in detoxification protocols.",
        "Studies have shown chamomile to have calming effects, reducing anxiety and promoting sleep, as well as reducing inflammation.",
        "Chrysanthemum has been researched for its antioxidant and anti-inflammatory properties, and its role in eye health and detoxification.",
        "Black cohosh has been studied for its efficacy in alleviating menopausal symptoms and its anti-inflammatory effects.",
        "Lemon has been widely studied for its high vitamin C content and antioxidant properties, particularly in boosting immunity and treating colds.",
        "Codonopsis has been researched for its adaptogenic properties, improving energy levels, and supporting immune function.",
        "Myrrh has shown antimicrobial, wound-healing, and anti-inflammatory effects in multiple studies.",
        "Turmeric's curcumin has been extensively studied for its anti-inflammatory and antioxidant effects.",
        "Wild yam's diosgenin is studied for its role in hormone regulation and menopausal symptom relief.",
        "Echinacea has been shown to enhance immune function and reduce the severity of colds.",
        "Research shows cardamom has antioxidant and digestive-enhancing properties.",
        "Siberian ginseng has been studied for its adaptogenic effects, helping the body manage stress.",
        "Eucalyptus oil has been studied for its efficacy in treating respiratory conditions and infections.",
        "Clove oil's eugenol has been researched for its pain-relieving and antiseptic properties, especially in dentistry.",
        "Meadowsweet contains salicylates, which have been researched for their anti-inflammatory and analgesic effects.",
        "Gentian has been studied for its bitter compounds, which stimulate digestion and appetite.",
        "Ginkgo biloba is extensively studied for improving memory and cognitive function, particularly in dementia.",
        "Licorice has been researched for its anti-inflammatory and mucoprotective effects, particularly in gastrointestinal disorders.",
        "Witch hazel has been studied for its astringent properties, particularly in skin conditions and minor wounds.",
        "Devil's Claw has been researched for its anti-inflammatory and analgesic effects in arthritis and musculoskeletal pain.",
        "Hops have been studied for their sedative properties, particularly in treating insomnia and anxiety.",
        "St. John's Wort has been extensively studied for its antidepressant effects, especially in mild to moderate depression.",
        "Elecampane's inulin and sesquiterpenes have been studied for their expectorant and antimicrobial effects in respiratory conditions.",
        "Research supports lavender's efficacy in reducing anxiety, promoting relaxation, and improving sleep quality.",
        "Studies highlight flaxseed's cardiovascular benefits, particularly in reducing cholesterol levels and supporting heart health.",
        "Tea tree oil has been extensively studied for its antimicrobial and antifungal properties, especially in skin infections like acne and athlete's foot.",
        "Lemon balm has been studied for its calming effects, particularly in reducing anxiety and improving sleep.",
        "Peppermint has been researched for its effectiveness in relieving irritable bowel syndrome symptoms, headaches, and respiratory conditions.",
        "Holy basil has been researched for its adaptogenic effects, helping the body cope with stress and enhancing immunity.",
        "Chinese peony has been studied for its anti-inflammatory, antispasmodic, and analgesic effects, particularly in gynecological conditions.",
        "Research indicates that Panax ginseng has significant anti-fatigue, immunomodulatory, and cognitive-enhancing properties due to its active ginsenosides.",
        "Studies suggest that Passiflora incarnata is effective in reducing anxiety and improving sleep quality, attributed to its flavonoid and alkaloid content.",
        "Research shows that Pelargonium sidoides is effective in treating acute bronchitis and other respiratory infections due to its antimicrobial and immune-modulating properties.",
        "Plantago spp. have been studied for their wound healing, anti-inflammatory, and mucilage-forming properties, particularly in treating skin and respiratory conditions.",
        "Studies on Rehmannia glutinosa suggest its potential in supporting adrenal function, reducing inflammation, and protecting against kidney damage.",
        "Rheum palmatum has been researched for its strong laxative effects and its role in promoting bowel movements and detoxification.",
        "Rhodiola rosea has been shown in studies to reduce stress-induced fatigue and improve cognitive function, particularly in high-stress environments.",
        "Research on Rosmarinus officinalis indicates its antioxidant and neuroprotective effects, with studies showing improvements in memory and cognitive function.",
        "Studies support the use of Salix alba for its anti-inflammatory and analgesic effects, particularly in conditions like arthritis and back pain.",
        "Salvia miltiorrhiza has been extensively studied for its cardiovascular benefits, including improving blood circulation and reducing oxidative stress.",
        "Research suggests that Salvia officinalis has potent antimicrobial and anti-inflammatory effects, particularly in oral health and cognitive support.",
        "Studies show that Sambucus nigra is effective in reducing the duration and severity of cold and flu symptoms due to its immune-boosting properties.",
        "Research on Schisandra chinensis indicates its adaptogenic properties, particularly in enhancing liver function and stress resistance.",
        "Scutellaria baicalensis has been studied for its strong anti-inflammatory and neuroprotective effects, making it useful in managing chronic inflammatory conditions.",
        "Research on Scutellaria lateriflora supports its use in reducing anxiety and improving sleep quality without significant sedative effects.",
        "Studies indicate that Serenoa repens is effective in treating benign prostatic hyperplasia (BPH) and improving urinary symptoms in men.",
        "Symphytum officinale has been researched for its wound-healing properties, particularly in speeding up the healing of sprains, bruises, and minor wounds.",
        "Tabebuia spp. have been studied for their antimicrobial properties, particularly in treating fungal and bacterial infections.",
        "Research supports the use of Tanacetum parthenium in the prevention of migraines and the reduction of inflammation.",
        "Studies show that Taraxacum officinale supports liver health and improves digestion, making it a popular remedy in detoxification protocols.",
        "Research indicates that Thymus vulgaris has potent antimicrobial and antioxidant properties, supporting its use in respiratory and digestive health.",
        "Studies suggest Turnera diffusa may enhance mood, reduce anxiety, and improve sexual health, though more research is needed to confirm its efficacy.",
        "Ulmus rubra has been researched for its soothing effects on the digestive system, particularly in managing conditions like GERD and IBS.",
        "Research on Urtica dioica shows its effectiveness in reducing inflammation, supporting prostate health, and alleviating allergy symptoms.",
        "Studies on Vaccinium myrtillus indicate its benefits for eye health, particularly in improving night vision and reducing the risk of cataracts.",
        "Valeriana officinalis has been widely studied for its ability to improve sleep quality and reduce anxiety, with evidence supporting its use as a natural sedative.",
        "Research suggests that Verbena officinalis has mild sedative and anti-anxiety properties, making it useful in treating insomnia and mild depression.",
        "Viburnum opulus has been studied for its effectiveness in relieving menstrual cramps and muscle spasms due to its antispasmodic properties.",
        "Vitex agnus-castus has been researched extensively for its ability to balance hormones and alleviate symptoms of PMS and menopause.",
        "Withania somnifera has been studied for its adaptogenic properties, showing benefits in reducing stress, improving cognitive function, and supporting overall vitality.",
        "Studies suggest Zanthoxylum americanum may improve circulation and relieve pain, particularly in conditions like arthritis.",
        "Research indicates that corn silk has diuretic properties and may help manage urinary tract infections and kidney stones.",
        "Ginger has been extensively studied for its anti-inflammatory effects, effectiveness in treating nausea, and digestive benefits.",
        "Acacia catechu is researched for its astringent and antimicrobial properties, supporting its use in treating diarrhea and infections.",
        "Studies on Aegle marmelos show its effectiveness in treating digestive disorders, particularly chronic diarrhea and dysentery.",
        "Agrimonia eupatoria has been studied for its anti-inflammatory and astringent effects, particularly in treating gastrointestinal conditions.",
        "Research on Althaea officinalis indicates its efficacy in soothing mucous membranes, making it useful in treating coughs and digestive irritation.",
        "Angelica archangelica has been studied for its digestive-stimulating properties and its effectiveness in relieving colds and respiratory conditions.",
        "Arnica montana has been widely researched for its topical use in treating bruises, sprains, and muscle pain due to its anti-inflammatory effects.",
        "Asparagus racemosus is well-researched in Ayurveda for its hormone-balancing effects and its role in enhancing fertility and reproductive health.",
        "Studies show that oats' beta-glucans have cholesterol-lowering effects and their avenanthramides provide anti-inflammatory benefits.",
        "Research indicates that Black Horehound has potential antiemetic and sedative properties, useful in treating nausea and anxiety.",
        "Beetroot is well-researched for its nitric oxide-boosting effects, improving cardiovascular health and athletic performance.",
        "Studies suggest Shepherd's Purse has hemostatic properties, effective in controlling bleeding and treating hemorrhages.",
        "Research highlights Cornflower's antioxidant and anti-inflammatory properties, particularly in skin and eye conditions.",
        "Iceland Moss has been studied for its mucilaginous content, which soothes mucous membranes, making it useful for coughs and respiratory issues.",
        "Fringed Pink is less studied but traditionally used as a diuretic and for its anti-inflammatory effects in urinary conditions.",
        "Centaury has been shown to possess digestive-stimulating and anti-inflammatory properties, enhancing bile secretion and treating indigestion.",
        "Boneset has demonstrated immune-boosting and fever-reducing effects, particularly in treating influenza and fevers.",
        "Eyebright is commonly used in herbal medicine for eye conditions, though scientific research is limited to its anti-inflammatory and astringent effects.",
        "Research suggests Buckwheat's rutin content helps in reducing blood pressure and has anti-inflammatory effects.",
        "Studies show Galbanum has antimicrobial and anti-inflammatory properties, effective in respiratory conditions.",
        "Fennel is well-researched for its digestive benefits and ability to alleviate colic and bloating.",
        "Wild Geranium has demonstrated astringent properties, making it useful for treating diarrhea and wounds.",
        "Motherwort is known for its calming effects on the heart and its use in regulating menstruation.",
        "Lemon Verbena is researched for its antioxidant properties and ability to reduce oxidative stress.",
        "Arrowroot is effective in treating digestive issues such as diarrhea and is a source of easily digestible starch.",
        "Cajeput oil has been shown to possess strong antiseptic and analgesic properties, useful for skin infections and pain relief.",
        "Chinese Mint is used in traditional medicine for indigestion and has cooling and anti-inflammatory effects.",
        "Pennyroyal is traditionally used for digestive complaints and as an insect repellent, though its use is limited due to potential toxicity.",
        "Studies show Catnip has calming and sedative effects, making it useful for anxiety and sleep disorders.",
        "Research supports Basil's antibacterial and anti-inflammatory effects, particularly in digestive health.",
        "Olive oil is well-researched for its cardiovascular benefits, thanks to its high antioxidant content.",
        "Anise is known for its carminative and expectorant properties, useful in treating digestive and respiratory issues.",
        "Studies show Black Pepper's piperine enhances nutrient absorption and provides strong antioxidant effects.",
        "Plantain has been shown to promote wound healing and reduce inflammation in skin conditions.",
        "Bistort is used traditionally for its astringent effects in treating diarrhea and other gastrointestinal issues.",
        "Balsam Poplar resin has demonstrated antimicrobial and anti-inflammatory properties, making it useful for respiratory ailments.",
        "Pomegranate's antioxidant properties are well-documented, with benefits for cardiovascular health and reducing inflammation.",
        "Oak bark has been traditionally used for its astringent and anti-inflammatory effects, especially for skin and gastrointestinal issues.",
        "Research supports the use of Lesser Celandine for treating varicose veins and hemorrhoids due to its anti-inflammatory effects.",
        "Studies have shown Goldenrod to be effective as a diuretic and in reducing inflammation in urinary tract conditions.",
        "Chickweed has been researched for its soothing properties on the skin and respiratory tract, especially for inflammatory conditions.",
        "Chirata is traditionally used in Ayurveda, with research backing its role in treating malaria and improving liver function.",
        "Tamarind is well-researched for its digestive benefits and its role in reducing inflammation and oxidative stress.",
        "Thuja occidentalis has been studied for its antiviral properties and its ability to stimulate the immune system.",
        "Linden flowers are known to have calming and anti-inflammatory properties, with research supporting their use in treating anxiety and colds.",
        "Heartsease has shown promise in treating skin conditions like eczema due to its anti-inflammatory and soothing effects.",
        "Lavender is widely researched for its calming and anti-inflammatory properties, particularly in treating anxiety and insomnia.",
        "Mint has been researched for its carminative effects and ability to relieve digestive discomfort.",
        "Research suggests that Euphrasia officinalis may help reduce eye irritation, conjunctivitis, and hay fever symptoms due to its anti-inflammatory properties.",
        "Studies indicate that Cinnamomum spp has anti-inflammatory, antimicrobial, and blood sugar-regulating properties, supporting its traditional uses.",
        "Barosma betulina is researched for its diuretic and antiseptic effects, particularly in treating urinary tract infections and inflammation.",
        "Ligusticum wallachii has been studied for its ability to promote blood circulation and alleviate pain, particularly in cardiovascular and menstrual conditions.",
        "Centella asiatica is well-researched for its cognitive-enhancing effects, wound-healing capabilities, and anti-inflammatory properties."
    ],
    "how_to_grow": [
        "Grows well in full sun or partial shade; prefers well-drained soil.",
        "Grows best in well-drained, fertile soil and full sun.",
        "Prefers dry, well-drained soil and full sun.",
        "Requires moist, well-drained soil and partial to full sun.",
        "Grows well in rich, moist soil with partial to full sun.",
        "Prefers rich, moist soil and full sun to partial shade.",
        "Grows best in well-drained soil with full sun.",
        "Prefers dry, well-drained soil and full sun.",
        "Prefers moist, well-drained soil and partial shade.",
        "Prefers well-drained soil and full sun to partial shade.",
        "Requires warm, sunny conditions and well-drained soil.",
        "Thrives in sandy, well-drained soil and full sun.",
        "Prefers moist, well-drained soil and full sun or partial shade.",
        "Grows best in well-drained soil with full sun to partial shade.",
        "Thrives in well-drained, fertile soil with full sun to partial shade.",
        "Prefers moist, well-drained soil and partial shade.",
        "Grows well in well-drained soil and full sun.",
        "Thrives in well-drained soil and full sun to partial shade.",
        "Grows best in arid, well-drained soil and full sun.",
        "Prefers well-drained, fertile soil in full sun or partial shade.",
        "Grows best in moist, well-drained soil in partial shade.",
        "Grows well in well-drained soil with full sun or partial shade.",
        "Prefers moist, well-drained soil in partial shade.",
        "Thrives in well-drained soil in full sun or partial shade.",
        "Grows well in well-drained soil with full sun exposure.",
        "Prefers well-drained soil and grows well in tropical climates.",
        "Grows best in moist, well-drained soil in full sun or partial shade.",
        "Prefers moist, well-drained soil in full sun or partial shade.",
        "Thrives in well-drained soil with full sun exposure.",
        "Grows well in deep, well-drained soil with full sun exposure.",
        "Prefers moist, well-drained soil in partial shade.",
        "Grows best in sandy, well-drained soil in full sun.",
        "Prefers well-drained, fertile soil in full sun.",
        "Thrives in well-drained soil with full sun exposure.",
        "Grows best in well-drained, fertile soil in full sun.",
        "Grows well in well-drained soil with full sun exposure; drought-tolerant.",
        "Prefers well-drained soil and full sun; grows well in temperate climates.",
        "Grows well in well-drained soil with full sun exposure; drought-tolerant.",
        "Prefers moist, well-drained soil in partial shade.",
        "Thrives in well-drained soil with full sun or partial shade.",
        "Grows well in well-drained soil with full sun exposure.",
        "Prefers moist, well-drained soil in full sun or partial shade.",
        "Prefers well-drained, sandy loam soil; grows best in partial shade; requires a cold winter to break dormancy.",
        "Thrives in well-drained soil with plenty of organic matter; prefers full sun to partial shade; needs regular watering during dry periods.",
        "Prefers sandy, well-drained soil; thrives in full sun; moderately drought-tolerant once established.",
        "Grows well in moist, well-drained soil; thrives in full sun or partial shade; can tolerate a variety of soil types.",
        "Prefers rich, well-drained soil; thrives in full sun to partial shade; needs regular watering.",
        "Grows best in fertile, well-drained soil; prefers full sun; needs regular watering during growing season.",
        "Prefers well-drained, rocky soil; thrives in full sun; highly tolerant of cold temperatures.",
        "Grows well in well-drained soil; prefers full sun; drought-tolerant once established.",
        "Prefers moist, well-drained soil; thrives in full sun; can tolerate a range of soil types.",
        "Prefers well-drained, sandy loam soil; thrives in full sun to partial shade; requires moderate watering.",
        "Prefers well-drained soil and full sun; drought-tolerant once established.",
        "Grows well in moist, well-drained soil; prefers full sun to partial shade; needs regular watering during dry periods.",
        "Prefers well-drained, loamy soil; thrives in partial shade to full sun; needs regular watering.",
        "Grows best in well-drained, sandy soil; prefers full sun; drought-tolerant once established.",
        "Prefers moist, well-drained soil; thrives in full sun to partial shade; needs regular watering.",
        "Grows well in sandy, well-drained soil; prefers full sun to partial shade; drought-tolerant once established.",
        "Prefers moist, well-drained soil; grows well in full sun or partial shade; needs regular watering.",
        "Grows well in well-drained soil; prefers full sun to partial shade; drought-tolerant once established.",
        "Prefers well-drained soil and full sun; needs regular watering during dry periods.",
        "Grows well in well-drained soil; prefers full sun; drought-tolerant once established.",
        "Prefers well-drained soil and full sun; drought-tolerant once established.",
        "Grows well in well-drained soil; prefers full sun to partial shade; drought-tolerant once established.",
        "Prefers moist, well-drained soil; thrives in full sun to partial shade; needs regular watering.",
        "Grows well in rich, moist soil; prefers full sun to partial shade; can be invasive in some regions.",
        "Prefers acidic, well-drained soil; thrives in full sun to partial shade; needs regular watering.",
        "Prefers moist, well-drained soil; grows best in full sun to partial shade; needs regular watering.",
        "Grows well in well-drained soil; prefers full sun to partial shade; drought-tolerant once established.",
        "Prefers moist, well-drained soil; thrives in full sun to partial shade; needs regular watering.",
        "Grows well in well-drained soil; prefers full sun to partial shade; drought-tolerant once established.",
        "Prefers sandy, well-drained soil; grows best in full sun to partial shade; drought-tolerant once established.",
        "Prefers well-drained soil; thrives in full sun to partial shade; drought-tolerant once established.",
        "Grows best in well-drained, fertile soil; prefers full sun and regular watering.",
        "Prefers well-drained soil; thrives in full sun to partial shade; needs regular watering.",
        "Grows well in dry, rocky soil; prefers full sun; drought-tolerant once established.",
        "Prefers well-drained soil; thrives in full sun to partial shade; needs regular watering.",
        "Grows best in well-drained soil; prefers full sun to partial shade; needs regular watering.",
        "Prefers moist, well-drained soil; thrives in full sun to partial shade; needs regular watering.",
        "Grows well in well-drained soil; prefers full sun to partial shade; needs regular watering.",
        "Prefers well-drained soil; thrives in full sun to partial shade; needs regular watering.",
        "Grows best in sandy, well-drained soil; prefers full sun to partial shade; needs regular watering.",
        "Prefers cool, moist climates; plant in well-drained, fertile soil.",
        "Grows in well-drained, neutral to alkaline soil; prefers full sun or partial shade.",
        "Thrives in well-drained soil and full sun; regular watering is needed.",
        "Grows well in most soils and in full sun; tolerates poor soils and dry conditions.",
        "Prefers full sun and well-drained soil; tolerates poor soils and drought.",
        "Grows in cold, mountainous regions; prefers acidic, well-drained soil.",
        "Thrives in well-drained soil and full sun; drought-tolerant once established.",
        "Prefers light, well-drained soils and full sun; grows well in meadows.",
        "Grows in moist, well-drained soil in full sun or partial shade.",
        "Thrives in well-drained soil and full sun or partial shade; prefers cooler climates.",
        "Grows best in well-drained, acidic soils in temperate climates; requires full sun.",
        "Prefers dry, rocky soils and full sun; grows in Mediterranean and Central Asian regions.",
        "Thrives in well-drained soil and full sun; requires moderate watering.",
        "Prefers moist, well-drained soils in partial shade; often found in woodlands.",
        "Grows in well-drained soil with full sun or partial shade; prefers temperate climates.",
        "Thrives in well-drained soil and full sun; requires regular watering in dry conditions.",
        "Prefers moist, well-drained soil in tropical or subtropical climates.",
        "Grows in well-drained soils in full sun; tolerates drought conditions.",
        "Grows well in moist, well-drained soil with full sun; requires regular watering.",
        "Prefers moist, well-drained soils and full sun or partial shade.",
        "Grows best in well-drained soil with full sun or partial shade; drought-tolerant.",
        "Thrives in warm climates with full sun and well-drained soil; regular watering is essential.",
        "Prefers well-drained soil and full sun; grows well in Mediterranean climates.",
        "Grows in well-drained soil and full sun; prefers temperate climates.",
        "Grows in well-drained, fertile soil with full sun; thrives in tropical and subtropical climates.",
        "Prefers moist, well-drained soil in full sun or partial shade; grows in temperate regions.",
        "Prefers moist, rich soil and grows well in partial shade.",
        "Grows in moist, well-drained soil with full sun; tolerant of cooler climates.",
        "Grows in well-drained soil with full sun; requires a long, hot growing season.",
        "Grows in well-drained soil with full sun or partial shade; tolerates a variety of soil conditions.",
        "Grows in moist, shaded areas; prefers rich, well-drained soil.",
        "Grows in full sun or partial shade in well-drained soil; tolerates dry conditions.",
        "Grows in moist, well-drained soil with partial shade; thrives in cool climates.",
        "Grows in well-drained, fertile soil with full sun or partial shade; prefers temperate regions.",
        "Thrives in tropical climates with well-drained soil; requires full sun.",
        "Grows in well-drained soil with full sun; tolerates cold and humid climates.",
        "Grows in moist, well-drained soil with full sun or partial shade; prefers temperate regions.",
        "Grows in well-drained soil with full sun or partial shade; prefers cool climates.",
        "Prefers well-drained soil and full sun; drought-tolerant once established.",
        "Grows in well-drained soil with full sun or partial shade; requires regular watering in hot climates.",
        "Prefers well-drained soil; thrives in full sun to partial shade; grows well in cooler climates.",
        "Prefers well-drained, fertile soil; thrives in warm, humid climates; requires regular watering.",
        "Grows best in well-drained, sandy soil; prefers full sun to partial shade; drought-tolerant once established.",
        "Prefers moist, well-drained soil; thrives in full sun to partial shade; needs regular watering.",
        "Prefers moist, well-drained soil; grows well in full sun to partial shade; needs regular watering."
    ],
    "warnings": [
        "Avoid use in pregnancy.",
        "High doses can cause gastrointestinal upset.",
        "Internal use should be limited to short durations.",
        "Consult a healthcare provider for prolonged use.",
        "Avoid in pregnancy and while breastfeeding.",
        "May interact with blood pressure medications.",
        "Avoid if allergic to ragweed or daisies.",
        "Use in small doses; avoid during pregnancy.",
        "Highly toxic; do not use without professional guidance.",
        "Discontinue use if allergic reactions occur.",
        "May interact with blood thinners and antihypertensive drugs.",
        "Should not be used for more than 7 consecutive days.",
        "Use with caution if prone to kidney stones.",
        "Discontinue use if allergic reactions occur.",
        "Consult a healthcare provider before use if pregnant or breastfeeding.",
        "Should not be used during pregnancy unless supervised by a healthcare provider.",
        "Excessive use can irritate the stomach; dilute lemon juice before consumption.",
        "Consult a healthcare provider if using long-term.",
        "Consult a healthcare provider if pregnant or breastfeeding.",
        "Use caution with blood-thinning medications.",
        "Avoid use in pregnancy and lactation.",
        "Do not use if allergic to Asteraceae family plants.",
        "Use with caution in individuals with gallstones.",
        "Not recommended for individuals with high blood pressure.",
        "Keep eucalyptus oil out of reach of children due to toxicity risks.",
        "Do not use clove oil internally in high doses.",
        "Avoid use in individuals allergic to aspirin.",
        "Avoid use in pregnancy and individuals with ulcers.",
        "Consult a healthcare provider before use if on blood-thinning medications.",
        "Prolonged use is not recommended due to potential for increased blood pressure.",
        "Avoid use on broken skin or open wounds.",
        "Not recommended during pregnancy.",
        "Use caution when operating heavy machinery due to sedative effects.",
        "May interact with prescription medications; consult a healthcare provider.",
        "Avoid in individuals with allergies to Asteraceae family plants.",
        "Avoid use during pregnancy due to its potential emmenagogue effects.",
        "Consult a healthcare provider before use if on anticoagulant medications.",
        "Do not ingest tea tree oil; toxic when swallowed.",
        "Avoid use during pregnancy and lactation.",
        "May cause irritation if applied topically to sensitive skin.",
        "Consult a healthcare provider before use if taking diabetes medications.",
        "Avoid use during pregnancy due to its uterine-stimulating effects.",
        "Avoid use in pregnancy and lactation.",
        "Not recommended during pregnancy or for individuals with low blood pressure.",
        "Not recommended for use during pregnancy or in individuals with severe liver disease.",
        "Avoid use during pregnancy and lactation.",
        "Not recommended during pregnancy, especially in the first trimester.",
        "Avoid during pregnancy and in individuals with gastrointestinal disorders.",
        "Avoid use during pregnancy and lactation.",
        "Not recommended during pregnancy or in individuals with epilepsy.",
        "Avoid use in children under 12 years of age; not recommended during pregnancy.",
        "Avoid use in pregnancy, especially in the first trimester.",
        "Avoid use during pregnancy and lactation.",
        "Not recommended during pregnancy; caution in individuals with autoimmune conditions.",
        "Avoid use during pregnancy and lactation.",
        "Not recommended during pregnancy or in individuals with severe liver disease.",
        "Avoid use during pregnancy, particularly in the first trimester.",
        "Not recommended during pregnancy or in individuals with hormone-sensitive conditions.",
        "Avoid internal use; not recommended during pregnancy.",
        "Avoid use during pregnancy and lactation.",
        "Not recommended during pregnancy or in individuals with a history of migraines.",
        "Avoid use during pregnancy and lactation.",
        "Avoid use during pregnancy and lactation.",
        "Not recommended during pregnancy or in individuals with hormone-sensitive conditions.",
        "Avoid use during pregnancy and lactation.",
        "Not recommended during pregnancy; caution in individuals with kidney problems.",
        "Avoid use during pregnancy and lactation.",
        "Not recommended during pregnancy or in individuals with severe liver disease.",
        "Avoid use during pregnancy, particularly in the first trimester.",
        "Not recommended during pregnancy due to its uterine-relaxing effects.",
        "Avoid use during pregnancy; caution in individuals with hormone-sensitive conditions.",
        "Avoid use during pregnancy and lactation; caution in individuals with thyroid conditions.",
        "Avoid use during pregnancy and lactation; not recommended for long-term use.",
        "Avoid use during pregnancy and lactation.",
        "Not recommended during pregnancy; caution in individuals with bleeding disorders.",
        "Avoid use during pregnancy; not recommended for individuals with kidney problems.",
        "Avoid use during pregnancy; not recommended for individuals with severe digestive issues.",
        "Not recommended during pregnancy or lactation.",
        "Avoid use during pregnancy, particularly in the first trimester.",
        "Not recommended during pregnancy; caution in individuals with diabetes.",
        "Avoid use during pregnancy; for external use only.",
        "Not recommended during pregnancy or in individuals with estrogen-sensitive conditions.",
        "Consult a healthcare provider before use if gluten sensitivity is a concern.",
        "Avoid use during pregnancy or breastfeeding due to limited safety data.",
        "Individuals prone to kidney stones should limit consumption due to high oxalate content.",
        "Avoid use in individuals with low blood pressure or thyroid conditions.",
        "Avoid direct contact with eyes in concentrated form.",
        "Not recommended for children or individuals with severe gastrointestinal disorders.",
        "Do not use in pregnancy or with kidney issues without medical supervision.",
        "Avoid use during pregnancy or breastfeeding without consulting a healthcare provider.",
        "Prolonged use should be avoided due to risk of liver toxicity.",
        "Avoid use in case of eye infections without medical advice.",
        "Individuals with sensitivities to similar grains should avoid.",
        "Not recommended for use in pregnancy or individuals with seizure disorders.",
        "Consult a healthcare provider before use if pregnant or breastfeeding.",
        "Avoid in large doses as it may cause gastrointestinal discomfort.",
        "Not recommended during pregnancy or for individuals with thyroid issues.",
        "Consult a healthcare provider before use during pregnancy or for prolonged use.",
        "Consult a healthcare provider if using in large quantities or if pregnant.",
        "Avoid use in infants or young children without consulting a healthcare provider.",
        "Use with caution in children and pregnant women; avoid in high doses.",
        "Not recommended for use in pregnancy or individuals with liver conditions.",
        "Avoid in pregnant women or those sensitive to its sedative effects.",
        "Consult a healthcare provider before use during pregnancy.",
        "No significant warnings; olive oil is generally considered safe.",
        "Not recommended for use during pregnancy; high doses may cause nausea.",
        "Excessive consumption may lead to digestive issues.",
        "No significant warnings; generally considered safe for topical and internal use.",
        "Avoid in individuals prone to oxalate kidney stones.",
        "Avoid during pregnancy or breastfeeding.",
        "Consult a healthcare provider before use if on medication for blood pressure or heart conditions.",
        "Use with caution in individuals with gastrointestinal sensitivity.",
        "Avoid internal use during pregnancy and in large doses.",
        "Avoid in individuals with plant allergies or hypersensitivity.",
        "No major warnings, though high doses may cause mild digestive upset.",
        "Not recommended during pregnancy or for individuals with low blood sugar levels.",
        "Excessive consumption may lead to digestive upset or diarrhea.",
        "Avoid during pregnancy; may cause skin reactions in sensitive individuals.",
        "Consult a healthcare provider before use during pregnancy.",
        "May cause mild irritation in sensitive individuals; consult a healthcare provider if pregnant.",
        "No major warnings; generally considered safe for topical and internal use.",
        "No major warnings; generally considered safe in moderate doses.",
        "Avoid use during pregnancy; caution in individuals with severe eye conditions.",
        "Not recommended during pregnancy; caution in individuals with bleeding disorders.",
        "Avoid use during pregnancy and lactation; not recommended for individuals with kidney problems.",
        "Not recommended during pregnancy or in individuals with bleeding disorders.",
        "Avoid use during pregnancy; caution in individuals with liver disease."
    ],
    "native_to": [
        "Native to temperate regions of the Northern Hemisphere.",
        "Native to Central Asia and northeastern Iran.",
        "Native to the Arabian Peninsula and North Africa.",
        "Native to China and Southeast Asia.",
        "Native to China and East Asia.",
        "Native to the Mediterranean region.",
        "Native to Europe and Northern Asia.",
        "Native to Europe, Asia, and North Africa.",
        "Native to Europe, North Africa, and Western Asia.",
        "Native to Southern Europe and the Mediterranean region.",
        "Native to Central and South America.",
        "Native to North Africa and the Middle East.",
        "Native to Europe and Western Asia.",
        "Native to Europe and Western Asia.",
        "Native to China and East Asia.",
        "Native to North America.",
        "Native to Southeast Asia and India.",
        "Native to China, Mongolia, and Korea.",
        "Native to the Arabian Peninsula and Northeastern Africa.",
        "Native to South Asia, particularly India.",
        "Native to North America.",
        "Native to North America and Europe.",
        "Native to the Indian subcontinent and Sri Lanka.",
        "Native to Siberia and Northeast Asia.",
        "Native to Australia.",
        "Native to the Maluku Islands in Indonesia.",
        "Native to Europe and Western Asia.",
        "Native to the mountainous regions of Central and Southern Europe.",
        "Native to China and Japan.",
        "Native to the Mediterranean and Southwest Asia.",
        "Native to North America, particularly the Eastern United States.",
        "Native to Southern Africa, particularly Namibia and Botswana.",
        "Native to Europe, Asia, and North America.",
        "Native to Europe and Western Asia.",
        "Native to Europe and Asia.",
        "Native to the Mediterranean region.",
        "Native to the Mediterranean region and Western Asia.",
        "Native to Australia.",
        "Native to Southern Europe and the Mediterranean region.",
        "Native to Europe and the Middle East.",
        "Native to the Indian subcontinent.",
        "Native to China and Siberia.",
        "Native to Korea, Northeast China, and Far East Russia.",
        "Native to the southeastern United States.",
        "Native to South Africa.",
        "Native to Europe and Asia.",
        "Native to China.",
        "Native to China and Tibet.",
        "Native to Arctic regions of Europe and Asia.",
        "Native to the Mediterranean region.",
        "Native to Europe, North Africa, and Western Asia.",
        "Native to China.",
        "Native to the Mediterranean region.",
        "Native to Europe, North Africa, and Western Asia.",
        "Native to Northern China, Russia, and Korea.",
        "Native to China, Mongolia, and Russia.",
        "Native to North America.",
        "Native to the southeastern United States.",
        "Native to Europe and Asia.",
        "Native to Central and South America.",
        "Native to Europe.",
        "Native to Europe, Asia, and North America.",
        "Native to the Mediterranean region.",
        "Native to Central and South America.",
        "Native to North America.",
        "Native to Europe, Asia, and North America.",
        "Native to Europe.",
        "Native to Europe and Asia.",
        "Native to Europe.",
        "Native to Europe and Asia.",
        "Native to the Mediterranean region and Western Asia.",
        "Native to India, North Africa, and the Middle East.",
        "Native to North America.",
        "Native to Central America.",
        "Native to Southeast Asia.",
        "Native to India and Southeast Asia.",
        "Native to India.",
        "Native to Europe and Asia.",
        "Native to Europe and Western Asia.",
        "Native to Europe and Asia.",
        "Native to Europe.",
        "Native to India.",
        "Native to Europe, but now widely cultivated in temperate regions worldwide.",
        "Native to Europe and Asia; now naturalized in North America.",
        "Native to the Mediterranean region; cultivated worldwide.",
        "Native to Europe and Asia; grows in temperate regions globally.",
        "Native to Europe and Western Asia; commonly found in meadows and grasslands.",
        "Native to Northern Europe and North America; thrives in alpine regions.",
        "Native to Europe and Asia; grows in temperate regions globally.",
        "Native to Europe; found in grasslands and meadows throughout temperate regions.",
        "Native to North America; found in wetlands and moist woodlands.",
        "Native to Europe and Asia; grows in grassy areas and meadows.",
        "Native to Central Asia; now widely cultivated in temperate regions worldwide.",
        "Native to Iran and Central Asia; grows in arid regions.",
        "Native to the Mediterranean; cultivated worldwide.",
        "Native to North America, particularly in woodlands and moist areas.",
        "Native to Europe and Asia; grows in temperate regions.",
        "Native to South America; cultivated in temperate regions globally.",
        "Native to the Caribbean and tropical Americas.",
        "Native to Southeast Asia and Australia.",
        "Native to East Asia, especially China and Japan.",
        "Native to Europe, North Africa, and parts of Asia.",
        "Native to Europe and Asia; now widespread in temperate regions.",
        "Native to tropical regions of central Africa and Southeast Asia.",
        "Native to the Mediterranean region; cultivated worldwide.",
        "Native to the eastern Mediterranean and Southwest Asia.",
        "Native to South India; cultivated in tropical regions worldwide.",
        "Native to Europe and Asia; now widespread in temperate regions.",
        "Native to Europe and Asia; grows in temperate regions.",
        "Native to North America, particularly in the northern United States and Canada.",
        "Native to the Middle East and South Asia; now cultivated worldwide.",
        "Native to Europe and parts of Asia.",
        "Native to Europe and Western Asia; now naturalized in North America.",
        "Native to Europe and Asia; now widespread in temperate regions.",
        "Native to Europe and Asia; now naturalized in temperate regions worldwide.",
        "Native to the Himalayan region; widely cultivated in India and Nepal.",
        "Native to tropical Africa; now cultivated in tropical regions worldwide.",
        "Native to North America and parts of Asia; widely cultivated in temperate regions.",
        "Native to Europe and North America; thrives in temperate regions.",
        "Native to Europe and Western Asia; now naturalized in temperate regions.",
        "Native to the Mediterranean region; widely cultivated worldwide.",
        "Native to Europe and Asia; now cultivated worldwide.",
        "Native to Europe and Asia.",
        "Native to Southeast Asia.",
        "Native to South Africa.",
        "Native to China and the Himalayan region.",
        "Native to Asia, particularly India and Sri Lanka."
    ],
    "medicinal_uses": [
        "Used for wound healing, digestive complaints, and inflammation.",
        "Widely used for cardiovascular health, immune support, and infection.",
        "Used topically for burns and skin irritation, internally for digestive health.",
        "Used for indigestion, inflammation, and joint pain.",
        "Used to support female reproductive health and blood circulation.",
        "Used for hypertension, joint pain, and digestive health.",
        "Used for detoxification, skin conditions, and as a diuretic.",
        "Used to treat digestive disorders, worm infestations, and loss of appetite.",
        "Used in small doses for muscle spasms, pain relief, and certain poisonings.",
        "Used topically for wounds, rashes, and inflammation.",
        "Used to improve digestion, stimulate circulation, and relieve pain.",
        "Used as a laxative for constipation relief.",
        "Used for detoxification, liver support, and as a mild laxative.",
        "Used to relieve anxiety, promote sleep, reduce inflammation, and treat digestive complaints.",
        "Used to treat headaches, eye irritation, and fever, and to support immune health.",
        "Primarily used to alleviate menopausal symptoms, menstrual cramps, and muscle pain.",
        "Used to treat colds, improve digestion, and boost immunity.",
        "Used to increase energy, support digestion, and enhance immune function.",
        "Used to treat infections, heal wounds, and reduce inflammation.",
        "Used for reducing inflammation, pain relief, and digestive support.",
        "Traditionally used for menstrual and menopausal symptoms, as well as digestive complaints.",
        "Used to support the immune system and reduce symptoms of the common cold.",
        "Used for digestive support, reducing bloating, and improving appetite.",
        "Used to enhance physical endurance, reduce stress, and support the immune system.",
        "Used for respiratory health, as well as in topical preparations for muscle pain.",
        "Used for toothache relief, digestive support, and as a warming spice.",
        "Used for pain relief, digestive issues, and as a natural antacid.",
        "Used to stimulate digestion and appetite, particularly in cases of poor digestion.",
        "Used to enhance memory, improve circulation, and support brain health.",
        "Used for digestive complaints, respiratory issues, and as a natural sweetener.",
        "Used topically for skin conditions, hemorrhoids, and minor wounds.",
        "Used to relieve arthritis pain, muscle pain, and digestive issues.",
        "Used for insomnia, anxiety, and digestive complaints.",
        "Used for mild to moderate depression, anxiety, and nerve pain.",
        "Used for respiratory conditions, particularly bronchitis and asthma.",
        "Used for reducing anxiety, improving sleep, and relieving headaches.",
        "Used for cardiovascular support, digestive health, and as an anti-inflammatory agent.",
        "Used topically for skin infections, cuts, and as an antimicrobial agent.",
        "Used for reducing anxiety, improving sleep, and supporting digestion.",
        "Used for digestive issues, headaches, and respiratory conditions.",
        "Used for enhancing immunity, reducing stress, and supporting respiratory health.",
        "Used for pain relief, gynecological issues, and as an anti-inflammatory agent.",
        "Used to enhance physical stamina, mental performance, and support immune function.",
        "Traditionally used to treat anxiety, insomnia, and gastrointestinal disturbances.",
        "Commonly used to treat respiratory infections, including bronchitis and sinusitis.",
        "Used for wound healing, treating respiratory and digestive issues, and reducing inflammation.",
        "Traditionally used to support kidney and adrenal health, and to reduce inflammation.",
        "Used as a laxative, digestive aid, and for detoxification.",
        "Used to reduce fatigue, enhance cognitive function, and improve resilience to stress.",
        "Used to improve memory, digestion, and reduce inflammation.",
        "Traditionally used to reduce pain, inflammation, and fever.",
        "Used to improve cardiovascular health, circulation, and reduce oxidative stress.",
        "Used to treat sore throats, digestive issues, and to support cognitive health.",
        "Traditionally used to treat cold and flu symptoms, boost the immune system, and reduce inflammation.",
        "Used to enhance physical endurance, support liver function, and improve stress resilience.",
        "Commonly used to treat inflammatory conditions, support liver health, and protect against neurodegenerative diseases.",
        "Used to alleviate anxiety, improve sleep quality, and reduce nervous tension.",
        "Used to support prostate health, treat urinary conditions, and reduce inflammation.",
        "Applied externally for wound healing, treating sprains, and reducing inflammation.",
        "Used to treat fungal and bacterial infections, support the immune system, and reduce inflammation.",
        "Traditionally used to prevent migraines, treat inflammatory conditions, and reduce fever.",
        "Used as a diuretic, to support liver function, and to improve digestion.",
        "Used to treat respiratory infections, digestive issues, and as a natural preservative.",
        "Traditionally used to enhance libido, improve mood, and reduce anxiety.",
        "Used to soothe the digestive tract, treat coughs, and support skin health.",
        "Commonly used to reduce inflammation, support urinary health, and treat allergy symptoms.",
        "Used to support eye health, improve circulation, and reduce inflammation.",
        "Commonly used to treat insomnia, reduce anxiety, and alleviate muscle tension.",
        "Traditionally used to treat headaches, insomnia, and mild depression.",
        "Used to relieve menstrual cramps, muscle spasms, and support uterine health.",
        "Used to balance hormones, alleviate PMS and menopause symptoms, and support reproductive health.",
        "Commonly used to reduce stress, improve energy levels, and support overall vitality.",
        "Used to stimulate circulation, relieve pain, and treat digestive issues.",
        "Traditionally used to manage urinary tract infections, kidney stones, and digestive disorders.",
        "Commonly used to treat nausea, support digestion, and reduce inflammation.",
        "Used to treat diarrhea, skin infections, and as an astringent for wounds.",
        "Traditionally used to treat digestive disorders, particularly diarrhea and dysentery.",
        "Commonly used to treat gastrointestinal conditions, as a mild astringent, and to reduce inflammation.",
        "Used to soothe coughs, treat respiratory irritation, and support digestive health.",
        "Traditionally used to stimulate digestion, relieve colds, and support respiratory health.",
        "Used topically to treat bruises, sprains, and muscle pain.",
        "Commonly used in Ayurveda to balance hormones, boost fertility, and support reproductive health.",
        "Used for skin conditions, inflammation, and as a dietary supplement to lower cholesterol.",
        "Traditionally used for digestive complaints, anxiety, and nausea.",
        "Supports liver health, reduces blood pressure, and improves athletic performance.",
        "Used for treating bleeding, heavy menstrual periods, and minor wounds.",
        "Traditionally used for eye irritation, skin inflammation, and as a mild tonic.",
        "Used for coughs, bronchitis, and soothing digestive and respiratory tracts.",
        "Used for urinary infections, edema, and as an anti-inflammatory agent.",
        "Used for indigestion, liver disorders, and as a tonic for digestive health.",
        "Commonly used for fevers, colds, flu, and immune system support.",
        "Used for eye inflammations, allergies, and upper respiratory infections.",
        "Used for improving digestion, supporting cardiovascular health, and as a gluten-free dietary alternative.",
        "Traditionally used for respiratory conditions, skin inflammations, and wound healing.",
        "Used for digestive complaints, coughs, and as a galactagogue to promote lactation.",
        "Used for treating diarrhea, wounds, and as an astringent in herbal medicine.",
        "Used to treat menstrual disorders, anxiety, and mild heart conditions.",
        "Used to alleviate digestive discomfort, reduce anxiety, and improve sleep quality.",
        "Used as a remedy for digestive issues, particularly diarrhea, and as a food thickener.",
        "Used for respiratory conditions, skin infections, and as a pain reliever.",
        "Used for digestive disorders, colds, and to freshen breath.",
        "Used for digestive issues, colds, and as an insect repellent.",
        "Used for calming the nervous system, promoting sleep, and aiding digestion.",
        "Used for digestive issues, inflammation, and as an antibacterial agent.",
        "Used to improve cardiovascular health, lower cholesterol, and reduce inflammation.",
        "Used for digestive complaints, coughs, and as a mild sedative.",
        "Used to improve digestion, relieve colds, and boost nutrient absorption.",
        "Used for wound healing, skin irritations, and as an anti-inflammatory.",
        "Used to treat diarrhea, inflammation, and as a wound healer.",
        "Used for respiratory conditions, skin infections, and as an anti-inflammatory.",
        "Used for cardiovascular health, digestive disorders, and as an antioxidant.",
        "Used for gastrointestinal complaints, skin conditions, and as a tonic.",
        "Used for treating hemorrhoids, varicose veins, and as an anti-inflammatory for skin conditions.",
        "Used to treat urinary tract infections, reduce inflammation, and support kidney health.",
        "Used for soothing skin irritations, respiratory conditions, and digestive complaints.",
        "Used for treating malaria, improving digestion, and as a liver tonic in Ayurveda.",
        "Used as a digestive aid, laxative, and anti-inflammatory for joint health.",
        "Used for treating respiratory infections, boosting the immune system, and as an antiviral.",
        "Used for calming anxiety, reducing inflammation, and treating colds and respiratory infections.",
        "Used for treating skin conditions, urinary infections, and respiratory issues.",
        "Used for calming the nervous system, promoting sleep, and treating skin inflammations.",
        "Used for digestive complaints, colds, and respiratory relief.",
        "Used to treat eye conditions, respiratory issues, and to reduce inflammation.",
        "Commonly used to treat digestive complaints, regulate blood sugar, and support cardiovascular health.",
        "Traditionally used to treat urinary tract infections, reduce inflammation, and support kidney health.",
        "Used to promote blood circulation, relieve pain, and treat cardiovascular and menstrual disorders.",
        "Commonly used to enhance cognitive function, heal wounds, and reduce inflammation."
    ],
    "cautions_on_use": [
        "May cause allergic reactions in sensitive individuals.",
        "May cause stomach upset or allergic reactions in some people.",
        "Overuse internally can lead to electrolyte imbalances due to its laxative effect.",
        "Use with caution in individuals with gallstones or gastrointestinal issues.",
        "Not recommended during pregnancy due to its emmenagogue effects.",
        "Large amounts may cause photosensitivity or skin irritation.",
        "May cause allergic reactions in individuals sensitive to the Asteraceae family.",
        "Avoid long-term use due to potential neurotoxicity from thujone content.",
        "Extremely toxic in high doses; use with caution and only under professional guidance.",
        "May cause allergic reactions in sensitive individuals.",
        "May cause stomach irritation in sensitive individuals.",
        "Prolonged use may lead to electrolyte imbalances.",
        "Not recommended for individuals with kidney stones due to high oxalate content.",
        "May cause allergic reactions in individuals sensitive to plants in the Asteraceae family.",
        "Not recommended for use during pregnancy without medical supervision.",
        "Should be used with caution in individuals with hormone-sensitive conditions.",
        "May cause tooth enamel erosion if consumed in excess.",
        "Use with caution in individuals with low blood pressure.",
        "May cause skin irritation or allergic reactions; use with caution.",
        "May cause gastrointestinal upset in sensitive individuals.",
        "Not recommended during pregnancy due to possible estrogenic effects.",
        "Use with caution in individuals with autoimmune disorders.",
        "Large doses may cause gastrointestinal discomfort.",
        "Avoid in individuals with high blood pressure.",
        "Eucalyptus oil should not be ingested internally in large amounts.",
        "High doses of clove oil can cause toxicity; use cautiously.",
        "Avoid in individuals allergic to salicylates.",
        "High doses may cause nausea; avoid in pregnancy.",
        "May increase bleeding risk; use with caution in individuals on anticoagulants.",
        "Avoid prolonged use in individuals with hypertension due to its mineralocorticoid effects.",
        "Topical use may cause irritation in sensitive individuals.",
        "May cause gastrointestinal upset; avoid in pregnancy.",
        "Use with caution in individuals with depression or taking sedatives.",
        "May interact with antidepressants; avoid use with other SSRIs.",
        "Large doses may cause gastrointestinal discomfort; avoid in pregnancy.",
        "May cause allergic reactions in sensitive individuals.",
        "May interfere with blood-thinning medications; use with caution in individuals with bleeding disorders.",
        "Avoid ingestion of tea tree oil; may cause toxicity.",
        "May cause allergic reactions in sensitive individuals.",
        "Use with caution in individuals with gastroesophageal reflux disease (GERD).",
        "May lower blood sugar levels; use with caution in individuals with diabetes.",
        "Use cautiously in individuals taking anticoagulant medications.",
        "May cause insomnia or agitation in sensitive individuals; avoid in individuals with hormone-sensitive conditions.",
        "May cause dizziness or confusion in high doses; caution in individuals on sedative medications.",
        "Potential for allergic reactions in sensitive individuals; caution in those with liver disease.",
        "May cause allergic reactions in some individuals; caution in those with a history of allergies.",
        "May cause mild gastrointestinal discomfort; caution in individuals with pre-existing liver conditions.",
        "Use with caution in individuals with gastrointestinal conditions; not recommended for long-term use due to potential for electrolyte imbalance.",
        "May cause dizziness or dry mouth; caution in individuals with bipolar disorder.",
        "May cause gastrointestinal upset or allergic reactions; avoid in individuals with epilepsy.",
        "May cause stomach upset; avoid in individuals allergic to aspirin.",
        "May cause mild gastrointestinal discomfort; caution in individuals on blood-thinning medications.",
        "May cause allergic reactions in sensitive individuals; caution in those with hormone-sensitive conditions.",
        "May cause gastrointestinal upset or allergic reactions in some individuals; caution in those with autoimmune conditions.",
        "May cause mild gastrointestinal discomfort; caution in individuals with peptic ulcers.",
        "May cause drowsiness or dizziness in some individuals; caution in those on sedative medications.",
        "May cause drowsiness or confusion; caution in individuals taking other sedative medications.",
        "May cause mild gastrointestinal discomfort; caution in individuals on hormone therapy.",
        "External use only; not recommended for internal use due to potential liver toxicity.",
        "May cause gastrointestinal upset; avoid in individuals with a history of liver disease.",
        "May cause allergic reactions; caution in individuals allergic to plants in the Asteraceae family.",
        "May cause allergic reactions in sensitive individuals; caution in those with gallbladder issues.",
        "May cause allergic reactions in sensitive individuals; caution in those with autoimmune conditions.",
        "May cause mild gastrointestinal discomfort; avoid in individuals with hormone-sensitive conditions.",
        "May cause allergic reactions in individuals sensitive to elm; caution in those with esophageal narrowing.",
        "May cause mild gastrointestinal discomfort; avoid use in individuals with fluid retention due to kidney or heart problems.",
        "May cause mild gastrointestinal discomfort; caution in individuals on blood-thinning medications.",
        "May cause drowsiness; caution in individuals operating heavy machinery or driving.",
        "May cause drowsiness or dizziness; caution in individuals with low blood pressure.",
        "May cause mild gastrointestinal discomfort; avoid use during pregnancy.",
        "May cause mild gastrointestinal discomfort; avoid use in individuals with hormone-sensitive conditions.",
        "May cause mild gastrointestinal discomfort; caution in individuals with thyroid conditions.",
        "May cause mild gastrointestinal discomfort; avoid use in individuals with sensitive skin.",
        "May cause mild allergic reactions in sensitive individuals; caution in those with corn allergies.",
        "May cause mild gastrointestinal discomfort; caution in individuals with gallstones or bleeding disorders.",
        "May cause mild gastrointestinal discomfort; avoid use in individuals with hypersensitivity to tannins.",
        "May cause mild gastrointestinal discomfort; avoid in individuals with chronic constipation.",
        "May cause mild gastrointestinal discomfort; avoid use during pregnancy.",
        "May cause allergic reactions in sensitive individuals; caution in those with diabetes due to high mucilage content.",
        "May cause mild gastrointestinal discomfort; avoid use during pregnancy.",
        "May cause allergic reactions in sensitive individuals; avoid applying to broken skin or open wounds.",
        "May cause mild gastrointestinal discomfort; caution in individuals with estrogen-sensitive conditions.",
        "May cause allergic reactions in individuals sensitive to gluten, although oats are generally considered gluten-free.",
        "Not recommended for use in pregnancy or by individuals with low blood pressure.",
        "Excessive consumption may cause beeturia (red urine) and lower blood pressure.",
        "Use with caution in individuals with thyroid conditions due to potential goitrogenic effects.",
        "May cause allergic reactions in sensitive individuals; use with caution around the eyes.",
        "Excessive use can cause stomach upset; not recommended for long-term use.",
        "Avoid during pregnancy and in individuals with kidney disorders.",
        "Not recommended for use in pregnancy or by individuals with stomach ulcers.",
        "Prolonged use may lead to liver toxicity; not recommended for long-term use.",
        "May cause mild irritation; avoid in individuals allergic to plants in the Scrophulariaceae family.",
        "May cause allergic reactions in individuals sensitive to gluten-like proteins, though it is generally considered gluten-free.",
        "Avoid during pregnancy and in individuals with epilepsy due to its stimulating properties.",
        "Fennel may cause allergic reactions in sensitive individuals and should be used with caution in pregnant women.",
        "Use with caution in individuals with sensitive stomachs, as it may cause irritation.",
        "Avoid use during pregnancy due to its potential to stimulate uterine contractions.",
        "Large amounts may cause stomach upset or mild nausea.",
        "No major cautions, but excessive use may lead to digestive upset.",
        "Avoid direct application of concentrated oil to the skin; dilute before use.",
        "May cause allergic reactions in some individuals; avoid large doses due to its menthol content.",
        "Avoid during pregnancy due to its emmenagogue effects; high doses can be toxic.",
        "May cause mild sedation; avoid use in pregnant women.",
        "Use with caution during pregnancy due to potential uterine stimulation.",
        "No significant cautions, but excessive consumption may lead to digestive upset.",
        "May cause allergic reactions in sensitive individuals; avoid use during pregnancy.",
        "Excessive use may cause gastrointestinal irritation.",
        "No major cautions, but large doses may cause digestive upset.",
        "Use with caution in individuals with oxalate kidney stones.",
        "Avoid use during pregnancy due to its uterine stimulant properties.",
        "No major cautions, though excessive consumption may affect digestion.",
        "Prolonged use of oak bark may irritate the gastrointestinal tract.",
        "Not recommended for internal use in large quantities due to potential toxicity.",
        "May cause allergic reactions in sensitive individuals.",
        "Generally safe, but large doses may cause digestive upset.",
        "Not recommended for use during pregnancy or in individuals with hypoglycemia.",
        "Excessive consumption may cause laxative effects.",
        "May cause allergic reactions in sensitive individuals; avoid during pregnancy.",
        "Use with caution during pregnancy; consult a healthcare provider before use.",
        "May cause mild skin irritation in sensitive individuals.",
        "Excessive use may cause headaches or nausea in sensitive individuals.",
        "No significant cautions, though excessive use may cause digestive upset.",
        "May cause mild irritation in sensitive individuals; avoid use during pregnancy.",
        "May cause allergic reactions in sensitive individuals; caution in those with liver disease.",
        "May cause mild gastrointestinal discomfort; avoid use during pregnancy.",
        "May cause mild gastrointestinal discomfort; avoid use during pregnancy and in individuals with bleeding disorders.",
        "May cause mild gastrointestinal discomfort; avoid use during pregnancy."
    ],
    "image_urls":[
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Achillea_millefolium_%28bright%29.jpg/500px-Achillea_millefolium_%28bright%29.jpg",
            "metadata": {
                "Artist": "SAplants",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/3/39/Allium_sativum_Woodwill_1793.jpg",
            "metadata": {
                "Artist": "Unknown",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Aloe_vera_flower_inset.png/500px-Aloe_vera_flower_inset.png",
            "metadata": {
                "Artist": "Collage by <a href=\"https://en.wikipedia.org/wiki/User:MidgleyDJ\" class=\"extiw\" title=\"en:User:MidgleyDJ\">en:User:MidgleyDJ</a>, original images from Wikimedia commons (<a href=\"//commons.wikimedia.org/wiki/File:Aloe_vera_offsets.jpg\" title=\"File:Aloe vera offsets.jpg\">Image:Aloe_vera_offsets.jpg</a> and <a href=\"//commons.wikimedia.org/wiki/File:Aloe_vera_C.jpg\" title=\"File:Aloe vera C.jpg\">Image:Aloe_vera_C.jpg</a>)",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/8/89/Alpinia_officinarum_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-156.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/2/24/Danggui_Angelica_sinensis.jpg",
            "metadata": {
                "Artist": "<span lang=\"en\">Anonymous</span><span style=\"display:none\">Unknown author</span>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/2023-06-22_Apium_graveolens_%28Wild_Celery%29%2C_Elswick%2C_Northumberland_4.jpg/500px-2023-06-22_Apium_graveolens_%28Wild_Celery%29%2C_Elswick%2C_Northumberland_4.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:MPF\" title=\"User:MPF\">MPF</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/ArctiumLappa1.jpg/500px-ArctiumLappa1.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Fice\" title=\"User:Fice\">Christian Fischer</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Artemisia_absinthium_P1210748.jpg/500px-Artemisia_absinthium_P1210748.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:David.Monniaux\" title=\"User:David.Monniaux\">David Monniaux</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Atropa_belladonna_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-018.jpg/500px-Atropa_belladonna_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-018.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Pot_marigold.jpg/500px-Pot_marigold.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Eatcha\" title=\"User:Eatcha\">Eatcha</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Capsicum_annuum_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-027.jpg/500px-Capsicum_annuum_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-027.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Senna_alexandrina_Mill.-Cassia_angustifolia_L._%28Senna_Plant%29.jpg/500px-Senna_alexandrina_Mill.-Cassia_angustifolia_L._%28Senna_Plant%29.jpg",
            "metadata": {
                "Artist": "<a rel=\"nofollow\" class=\"external text\" href=\"https://www.flickr.com/people/45835639@N04\">Lalithamba</a> from India",
                "LicenseShortName": "CC BY 2.0",
                "UsageTerms": "Creative Commons Attribution 2.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by/2.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Rumex_crispus_vallee-de-grace-amiens_80_12062007_3.jpg/500px-Rumex_crispus_vallee-de-grace-amiens_80_12062007_3.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Pichard\" title=\"User:Pichard\">Olivier Pichard</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Matricaria_February_2008-1.jpg/500px-Matricaria_February_2008-1.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Alvesgaspar\" title=\"User:Alvesgaspar\">Alvesgaspar</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Chrysanthemum.JPG/500px-Chrysanthemum.JPG",
            "metadata": {
                "Artist": "<a href=\"https://en.wikipedia.org/wiki/ml:User:Aruna\" class=\"extiw\" title=\"w:ml:User:Aruna\">Aruna</a> at <a href=\"https://en.wikipedia.org/wiki/ml:\" class=\"extiw\" title=\"w:ml:\">Malayalam Wikipedia</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Actaea_racemosa_002.JPG/500px-Actaea_racemosa_002.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Llez\" title=\"User:Llez\">H. Zell</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/P1030323.JPG/500px-P1030323.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Eola\" title=\"User:Eola\">Elena Chochkova</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Codonopsis_pilosula_flowers.jpg/500px-Codonopsis_pilosula_flowers.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Doronenko\" title=\"User:Doronenko\">Doronenko</a>",
                "LicenseShortName": "CC BY 2.5",
                "UsageTerms": "Creative Commons Attribution 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/8/86/Commiphora_myrrha_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-019.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Turmeric_inflorescence.jpg/500px-Turmeric_inflorescence.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/w/index.php?title=User:Sksiddhartthan&amp;action=edit&amp;redlink=1\" class=\"new\" title=\"User:Sksiddhartthan (page does not exist)\">SKsiddhartthan</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Wild_yam_in_woods_-_young_plants.jpg/500px-Wild_yam_in_woods_-_young_plants.jpg",
            "metadata": {
                "Artist": "No machine-readable author provided. <a href=\"//commons.wikimedia.org/wiki/User:Phyzome\" title=\"User:Phyzome\">Phyzome</a> assumed (based on copyright claims).",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/0/07/Echinacea_laevigata.jpg",
            "metadata": {
                "Artist": "Unknown author<span style=\"display: none;\">Unknown author</span>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Elettaria_cardamomum_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-057.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Eleutherococcus_senticosus.jpg/500px-Eleutherococcus_senticosus.jpg",
            "metadata": {
                "Artist": "Stanislav Doronenko",
                "LicenseShortName": "CC BY 2.5",
                "UsageTerms": "Creative Commons Attribution 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/4/42/Eucalyptus_globulus_subsp._maidenii.jpg",
            "metadata": {
                "Artist": "Ian Brooker and David Kleinig",
                "LicenseShortName": "CC BY 3.0 au",
                "UsageTerms": "Creative Commons Attribution 3.0 au",
                "LicenseUrl": "https://creativecommons.org/licenses/by/3.0/au/deed.en",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Syzygium_aromaticum_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-030.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/20140715Filipendula_ulmaria.jpg/500px-20140715Filipendula_ulmaria.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:AnRo0002\" title=\"User:AnRo0002\">AnRo0002</a>",
                "LicenseShortName": "CC0",
                "UsageTerms": "Creative Commons Zero, Public Domain Dedication",
                "LicenseUrl": "http://creativecommons.org/publicdomain/zero/1.0/deed.en",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Gelber_Enzian_%28Gentiana_lutea%29%2C_Bl%C3%BCtenstand.jpg/500px-Gelber_Enzian_%28Gentiana_lutea%29%2C_Bl%C3%BCtenstand.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:HStau\" title=\"User:HStau\">Heinz Staudacher</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/GINKGOBAUM-2.jpg/500px-GINKGOBAUM-2.jpg",
            "metadata": {
                "Artist": "<ul><li><a href=\"//commons.wikimedia.org/wiki/File:EecherplazGinkgo06.jpg\" title=\"File:EecherplazGinkgo06.jpg\">EecherplazGinkgo06.jpg</a>: <a href=\"//commons.wikimedia.org/wiki/User:Cayambe\" title=\"User:Cayambe\">Cayambe</a></li>\n<li>derivative work: <a href=\"//commons.wikimedia.org/wiki/User:Ginkgotree\" title=\"User:Ginkgotree\">Ginkgotree</a> (<a href=\"//commons.wikimedia.org/wiki/User_talk:Ginkgotree\" title=\"User talk:Ginkgotree\"><span class=\"signature-talk\">talk</span></a>)</li></ul>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Illustration_Glycyrrhiza_glabra0.jpg/500px-Illustration_Glycyrrhiza_glabra0.jpg",
            "metadata": {
                "Artist": "Unknown",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Hamamelis_virginiana_FlowersLeaves_BotGardBln0906.JPG/500px-Hamamelis_virginiana_FlowersLeaves_BotGardBln0906.JPG",
            "metadata": {
                "Artist": "Wikipedia user - BotBln",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Harpagophytum_5.jpg/500px-Harpagophytum_5.jpg",
            "metadata": {
                "Artist": "The original uploader was <a href=\"https://en.wikipedia.org/wiki/fr:User:Henri_pidoux\" class=\"extiw\" title=\"w:fr:User:Henri pidoux\">Henri pidoux</a> at <a href=\"https://en.wikipedia.org/wiki/fr:\" class=\"extiw\" title=\"w:fr:\">French Wikipedia</a>.",
                "LicenseShortName": "Attribution",
                "UsageTerms": "Unknown",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "False"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Hopfen1.jpg/500px-Hopfen1.jpg",
            "metadata": {
                "Artist": "No machine-readable author provided. <a href=\"//commons.wikimedia.org/wiki/User:Hagen_Graebner\" title=\"User:Hagen Graebner\">Hagen Graebner</a> assumed (based on copyright claims).",
                "LicenseShortName": "CC BY-SA 2.5",
                "UsageTerms": "Creative Commons Attribution-Share Alike 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Saint_John%27s_wort_flowers.jpg/500px-Saint_John%27s_wort_flowers.jpg",
            "metadata": {
                "Artist": "<p><br style=\"clear:both\">\n</p>\n<table align=\"CENTER\" style=\"width:80%; background-color:#f7f8ff; border:2px solid #8888aa; padding:5px;\">\n\n<tbody><tr>\n<td><table border=\"0\" width=\"100%\" style=\"background-color:#f7f8ff;\">\n\t<tbody><tr style=\"font-family: Segoe UI, Trebuchet MS, serif;\">\n\t\t<td align=\"center\" valign=\"top\">\n\t\t<div style=\"padding-bottom:25px;\"><span style=\"font-size:large;\"><b><a href=\"https://en.wikipedia.org/wiki/User:Fir0002\" class=\"extiw\" title=\"en:User:Fir0002\">fir0002</a> <br> flagstaffotos [at] gmail.com</b></span></div>\n\t\t<div style=\"font-size:11pt\">Canon 20D + Tamron 28-75mm f/2.8</div>\n</td>\n\t\t<td valign=\"top\" align=\"left\">\n                    <table border=\"0\" width=\"240\" style=\"background-color:#f7f8ff;\">\n                         <tbody><tr>\n                         <td><figure class=\"mw-halign-left\" typeof=\"mw:File\"><a href=\"//commons.wikimedia.org/wiki/File:Cut_out_view_04.png\" class=\"mw-file-description\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Cut_out_view_04.png/90px-Cut_out_view_04.png\" decoding=\"async\" width=\"90\" height=\"75\" class=\"mw-file-element\" srcset=\"https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Cut_out_view_04.png/135px-Cut_out_view_04.png 1.5x, https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Cut_out_view_04.png/180px-Cut_out_view_04.png 2x\" data-file-width=\"274\" data-file-height=\"229\"></a><figcaption></figcaption></figure></td>\n                         <td><figure class=\"mw-halign-left\" typeof=\"mw:File\"><a href=\"//commons.wikimedia.org/wiki/File:Cut_out_view_03.png\" class=\"mw-file-description\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Cut_out_view_03.png/90px-Cut_out_view_03.png\" decoding=\"async\" width=\"90\" height=\"108\" class=\"mw-file-element\" srcset=\"https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Cut_out_view_03.png/135px-Cut_out_view_03.png 1.5x, https://upload.wikimedia.org/wikipedia/commons/7/7b/Cut_out_view_03.png 2x\" data-file-width=\"157\" data-file-height=\"188\"></a><figcaption></figcaption></figure></td>\n                         <td><figure class=\"mw-halign-left\" typeof=\"mw:File\"><a href=\"//commons.wikimedia.org/wiki/File:Cut_out_view_01.png\" class=\"mw-file-description\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Cut_out_view_01.png/90px-Cut_out_view_01.png\" decoding=\"async\" width=\"90\" height=\"82\" class=\"mw-file-element\" srcset=\"https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Cut_out_view_01.png/135px-Cut_out_view_01.png 1.5x, https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Cut_out_view_01.png/180px-Cut_out_view_01.png 2x\" data-file-width=\"250\" data-file-height=\"229\"></a><figcaption></figcaption></figure></td>\n                         </tr>\n                         </tbody></table>\n\t\t</td>\n\t</tr>\n</tbody></table>\n</td></tr></tbody></table>",
                "LicenseShortName": "GFDL 1.2",
                "UsageTerms": "GNU Free Documentation License 1.2",
                "LicenseUrl": "http://www.gnu.org/licenses/old-licenses/fdl-1.2.html",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/InulaHelenium.jpg/500px-InulaHelenium.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Natthager\" title=\"User:Natthager\">Natthager</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/4/40/Lavandula_angustifolia_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-087.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/K%C3%B6hler%27s_Medizinal-Pflanzen_in_naturgetreuen_Abbildungen_mit_kurz_erl%C3%A4uterndem_Texte_%28Plate_16%29_BHL303594.jpg/500px-K%C3%B6hler%27s_Medizinal-Pflanzen_in_naturgetreuen_Abbildungen_mit_kurz_erl%C3%A4uterndem_Texte_%28Plate_16%29_BHL303594.jpg",
            "metadata": {
                "Artist": "Brandt, Wilhelm; Gürke, M.; Khler, F. E.; Pabst, G.; Schellenberg, G.; Vogtherr, Max.",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Melaleuca_alternifolia_flowers.jpg/500px-Melaleuca_alternifolia_flowers.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Gderrin\" title=\"User:Gderrin\">Geoff Derrin</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Lemon_balm_plant.jpg/500px-Lemon_balm_plant.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Amitchell125\" title=\"User:Amitchell125\">Amitchell125</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Pfefferminze_natur_peppermint.jpg/500px-Pfefferminze_natur_peppermint.jpg",
            "metadata": {
                "Artist": "Unknown",
                "LicenseShortName": "CC BY 3.0",
                "UsageTerms": "Creative Commons Attribution 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Tulsi_or_Tulasi_Holy_basil.jpg/500px-Tulsi_or_Tulasi_Holy_basil.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Shashidhara_halady\" title=\"User:Shashidhara halady\">Shashidhara halady</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Lactiflora1b.UME.jpg/500px-Lactiflora1b.UME.jpg",
            "metadata": {
                "Artist": "Ulf Eliasson",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Ginsengpflanze.jpg/500px-Ginsengpflanze.jpg",
            "metadata": {
                "Artist": "FloraFarm GmbH / Katharina Lohrie",
                "LicenseShortName": "CC BY 3.0",
                "UsageTerms": "Creative Commons Attribution 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Passiflora_incarnata_fruit.jpg/500px-Passiflora_incarnata_fruit.jpg",
            "metadata": {
                "Artist": "<a href=\"https://hu.wikipedia.org/wiki/User:H3ini\" class=\"extiw\" title=\"hu:User:H3ini\">H3ini</a>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Pelargonium_sidoides_Leaves_3264px.jpg/500px-Pelargonium_sidoides_Leaves_3264px.jpg",
            "metadata": {
                "Artist": "Photo by and (c)2006 Derek Ramsey (<a href=\"https://en.wikipedia.org/wiki/User:Ram-Man\" class=\"extiw\" title=\"en:User:Ram-Man\">Ram-Man</a>).  Location credit to the Chanticleer Garden.",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Plantago_major.jpg",
            "metadata": {
                "Artist": "<a href=\"https://en.wikipedia.org/wiki/User:Iorsh\" class=\"extiw\" title=\"wikipedia:User:Iorsh\">Iorsh</a> at <a href=\"https://en.wikipedia.org/wiki/\" class=\"extiw\" title=\"wikipedia:\">English Wikipedia</a>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Rehmannia.JPG/500px-Rehmannia.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Shizhao\" title=\"User:Shizhao\">Shizhao</a>",
                "LicenseShortName": "CC BY 2.5",
                "UsageTerms": "Creative Commons Attribution 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Apothekergarten_Seligenstadt_Rheum_Palmatum_Medizinalrhabarber2.jpg/500px-Apothekergarten_Seligenstadt_Rheum_Palmatum_Medizinalrhabarber2.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:AlexanderKlink\" title=\"User:AlexanderKlink\">Alexander Klink</a>",
                "LicenseShortName": "CC BY 4.0",
                "UsageTerms": "Creative Commons Attribution 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Rhodiola_rosea_a2.jpg/500px-Rhodiola_rosea_a2.jpg",
            "metadata": {
                "Artist": "Opioła Jerzy",
                "LicenseShortName": "CC BY 2.5",
                "UsageTerms": "Creative Commons Attribution 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Rosemary_in_bloom.JPG/500px-Rosemary_in_bloom.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Margalob\" title=\"User:Margalob\">Margalob</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Salix_alba_leaves.jpg/500px-Salix_alba_leaves.jpg",
            "metadata": {
                "Artist": "No machine-readable author provided. <a href=\"//commons.wikimedia.org/wiki/User:MPF\" title=\"User:MPF\">MPF</a> assumed (based on copyright claims).",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Salviamiltiorrhiza.jpg/500px-Salviamiltiorrhiza.jpg",
            "metadata": {
                "Artist": "<a href=\"https://en.wikipedia.org/wiki/User:First_Light\" class=\"extiw\" title=\"en:User:First Light\">First Light</a> (<a href=\"https://en.wikipedia.org/wiki/User_talk:First_Light\" class=\"extiw\" title=\"en:User talk:First Light\">talk</a>)",
                "LicenseShortName": "CC BY 3.0",
                "UsageTerms": "Creative Commons Attribution 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Salvia_officinalis0.jpg/500px-Salvia_officinalis0.jpg",
            "metadata": {
                "Artist": "Kurt Stüber <a rel=\"nofollow\" class=\"external autonumber\" href=\"http://www.kurtstueber.de/\">[1]</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Sambucus_nigra_004.jpg/500px-Sambucus_nigra_004.jpg",
            "metadata": {
                "Artist": "Willow",
                "LicenseShortName": "CC BY 2.5",
                "UsageTerms": "Creative Commons Attribution 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Schisandra_sinensis.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Doronenko\" title=\"User:Doronenko\">Doronenko</a>",
                "LicenseShortName": "CC BY 2.5",
                "UsageTerms": "Creative Commons Attribution 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/4/44/Scutellaria_baicalensis_flowers.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Doronenko\" title=\"User:Doronenko\">Doronenko</a>",
                "LicenseShortName": "CC BY 3.0",
                "UsageTerms": "Creative Commons Attribution 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Scutellaria_lateriflora_01.JPG/500px-Scutellaria_lateriflora_01.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Rolf_Engstrand\" title=\"User:Rolf Engstrand\">Rolf Engstrand</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Serenoa_repens_USDA1.jpg/500px-Serenoa_repens_USDA1.jpg",
            "metadata": {
                "Artist": "Ted Bodner, Southern Weed Science Society, United States",
                "LicenseShortName": "CC BY 3.0 us",
                "UsageTerms": "Creative Commons Attribution 3.0 us",
                "LicenseUrl": "https://creativecommons.org/licenses/by/3.0/us/deed.en",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Symphytum_officinale_01.jpg/500px-Symphytum_officinale_01.jpg",
            "metadata": {
                "Artist": "Agnieszka Kwiecień (<a href=\"//commons.wikimedia.org/wiki/User:Nova\" title=\"User:Nova\">Nova</a>)",
                "LicenseShortName": "CC BY 2.5",
                "UsageTerms": "Creative Commons Attribution 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Caribbean_Trumpet_Tree_%28Tabebuia_aurea%29_fruit_%26_flowers_W_IMG_7055.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:J.M.Garg\" title=\"User:J.M.Garg\">J.M.Garg</a>",
                "LicenseShortName": "CC BY 3.0",
                "UsageTerms": "Creative Commons Attribution 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Feverfew.jpg/500px-Feverfew.jpg",
            "metadata": {
                "Artist": "Unknown",
                "LicenseShortName": "CC BY 2.5",
                "UsageTerms": "Creative Commons Attribution 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Taraxacum_officinale_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-135.jpg/500px-Taraxacum_officinale_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-135.jpg",
            "metadata": {
                "Artist": "<bdi><a href=\"https://en.wikipedia.org/wiki/en:Walther_Otto_M%C3%BCller\" class=\"extiw\" title=\"w:en:Walther Otto Müller\"><span title=\"German botanist (1833-1887)\">Walther Otto Müller</span></a>\n</bdi>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Thymus_vulgaris1.JPG/500px-Thymus_vulgaris1.JPG",
            "metadata": {
                "Artist": "Henry Brisse (upload by <a href=\"//commons.wikimedia.org/wiki/User:Abalg\" title=\"User:Abalg\">user:Abalg</a>)",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Turnera_diffusa_var._aphrodisiaca_002.JPG/500px-Turnera_diffusa_var._aphrodisiaca_002.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Llez\" title=\"User:Llez\">H. Zell</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Mature_Ulmus_rubra_in_graveyard.jpg",
            "metadata": {
                "Artist": "Unknown",
                "LicenseShortName": "Attribution",
                "UsageTerms": "Unknown",
                "LicenseUrl": "https://web.archive.org/web/20050310143210/http://www.dnr.state.oh.us/forestry/Education/ohiotrees/elmslippery.htm",
                "AttributionRequired": "False"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Br%C3%A4nn%C3%A4ssla_%28Urtica_Dioica%29.jpg/500px-Br%C3%A4nn%C3%A4ssla_%28Urtica_Dioica%29.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/w/index.php?title=User:Skalle-Per_Hedenh%C3%B6s&amp;action=edit&amp;redlink=1\" class=\"new\" title=\"User:Skalle-Per Hedenhs (page does not exist)\">Skalle-Per Hedenhs</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/203_Vaccinum_myrtillus_L.jpg/500px-203_Vaccinum_myrtillus_L.jpg",
            "metadata": {
                "Artist": "<bdi><a href=\"https://en.wikipedia.org/wiki/en:Am%C3%A9d%C3%A9e_Masclef\" class=\"extiw\" title=\"w:en:Amédée Masclef\"><span title=\"botanist\">Amédée Masclef</span></a>\n</bdi>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Valeriana_officinalis_-_Niitv%C3%A4lja.jpg/500px-Valeriana_officinalis_-_Niitv%C3%A4lja.jpg",
            "metadata": {
                "Artist": "<div class=\"fn value\">\n<a href=\"//commons.wikimedia.org/wiki/User:Iifar\" title=\"User:Iifar\">Ivar Leidus</a></div>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Eisenkraut%2C_Passau.JPG/500px-Eisenkraut%2C_Passau.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Konrad_Lackerbeck\" title=\"User:Konrad Lackerbeck\">Konrad Lackerbeck</a>",
                "LicenseShortName": "CC BY-SA 2.5",
                "UsageTerms": "Creative Commons Attribution-Share Alike 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Viburnum_01.JPG/500px-Viburnum_01.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Lestath\" title=\"User:Lestath\">Lestat</a> (Jan Mehlich)",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Vitex_agnus-castus_1.JPG/500px-Vitex_agnus-castus_1.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Cillas\" title=\"User:Cillas\">Cillas</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/WithaniaFruit.jpg/500px-WithaniaFruit.jpg",
            "metadata": {
                "Artist": "<a href=\"https://en.wikipedia.org/wiki/User:Wowbobwow12\" class=\"extiw\" title=\"w:User:Wowbobwow12\">Wowbobwow12</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Zanthoxylum_americanum.jpg/500px-Zanthoxylum_americanum.jpg",
            "metadata": {
                "Artist": "A. Barra",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Zea_mays_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-283.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Koeh-146-no_text.jpg/500px-Koeh-146-no_text.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Acacia_catechu_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-003.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Bael_%28Aegle_marmelos%29_tree_at_Narendrapur_W_IMG_4116.jpg/500px-Bael_%28Aegle_marmelos%29_tree_at_Narendrapur_W_IMG_4116.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:J.M.Garg\" title=\"User:J.M.Garg\">J.M.Garg</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Illustration_Agrimonia_eupatoria0.jpg/500px-Illustration_Agrimonia_eupatoria0.jpg",
            "metadata": {
                "Artist": "Unknown",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Althaea_officinalis_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-008.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Koehler1887-GardenAngelica.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Arnica_montana_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-015.jpg/500px-Arnica_montana_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-015.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khlers Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Asparagus_racemosus.JPG/500px-Asparagus_racemosus.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/w/index.php?title=User:Neha.Vindhya&amp;action=edit&amp;redlink=1\" class=\"new\" title=\"User:Neha.Vindhya (page does not exist)\">Neha.Vindhya</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/AvenaSativa3.jpg/500px-AvenaSativa3.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Fice\" title=\"User:Fice\">Christian Fischer</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Ballota_nigra_2005.06.19_10.13.06-p6190007.jpg/500px-Ballota_nigra_2005.06.19_10.13.06-p6190007.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Mbc\" title=\"User:Mbc\">Michael Becker</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Beta_vulgaris_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-167.jpg",
            "metadata": {
                "Artist": "<bdi><a href=\"https://en.wikipedia.org/wiki/en:Walther_Otto_M%C3%BCller\" class=\"extiw\" title=\"w:en:Walther Otto Müller\"><span title=\"German botanist (1833-1887)\">Walther Otto Müller</span></a>\n</bdi>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/A_Field_of_Shepherd%E2%80%99s-purse.jpg/500px-A_Field_of_Shepherd%E2%80%99s-purse.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/w/index.php?title=User:SaltySemanticSchmuck&amp;action=edit&amp;redlink=1\" class=\"new\" title=\"User:SaltySemanticSchmuck (page does not exist)\">SaltySemanticSchmuck</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Centaurea_cyanus_scan.jpg/500px-Centaurea_cyanus_scan.jpg",
            "metadata": {
                "Artist": "[<a rel=\"nofollow\" class=\"external text\" href=\"http://www.osnatamir.com\">Osnat Ravid Amir</a>]",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Cetraria_islandica_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-032.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Dianthus_superbus_140805a.jpg/500px-Dianthus_superbus_140805a.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:BerndH\" title=\"User:BerndH\">Bernd Haynold</a>",
                "LicenseShortName": "CC BY-SA 2.5",
                "UsageTerms": "Creative Commons Attribution-Share Alike 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Centaurium_erythraea_220603.jpg/500px-Centaurium_erythraea_220603.jpg",
            "metadata": {
                "Artist": "Picture taken by <a href=\"//commons.wikimedia.org/wiki/User:BerndH\" title=\"User:BerndH\">BerndH</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Eupatorium_perfoliatum_001.JPG/500px-Eupatorium_perfoliatum_001.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:SB_Johnny\" title=\"User:SB Johnny\">SB_Johnny</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Amblyptilia_acanthadactyla_%287928702622%29.jpg/500px-Amblyptilia_acanthadactyla_%287928702622%29.jpg",
            "metadata": {
                "Artist": "<a rel=\"nofollow\" class=\"external text\" href=\"https://www.flickr.com/people/26138378@N03\">Patrick Clement</a> from West Midlands, England",
                "LicenseShortName": "CC BY 2.0",
                "UsageTerms": "Creative Commons Attribution 2.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by/2.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Japanese_Buckwheat_Flower.JPG/500px-Japanese_Buckwheat_Flower.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/w/index.php?title=User:STRONGlk7&amp;action=edit&amp;redlink=1\" class=\"new\" title=\"User:STRONGlk7 (page does not exist)\">STRONGlk7</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/K%C3%B6hler_Ferula_gummosa.jpg/500px-K%C3%B6hler_Ferula_gummosa.jpg",
            "metadata": {
                "Artist": "Unknown author<span style=\"display: none;\">Unknown author</span>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Foeniculum_July_2011-1a.jpg/500px-Foeniculum_July_2011-1a.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Alvesgaspar\" title=\"User:Alvesgaspar\">Alvesgaspar</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Geranium_maculatum_Leatherwood_Lake.jpg/500px-Geranium_maculatum_Leatherwood_Lake.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Eric_in_SF\" title=\"User:Eric in SF\">Eric in SF</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Motherwort.jpg/500px-Motherwort.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Dger\" title=\"User:Dger\">D. Gordon E. Robertson</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Aloysia_citriodora_002.jpg/500px-Aloysia_citriodora_002.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Llez\" title=\"User:Llez\">H. Zell</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Marant_arund_090103-5154_rwg.JPG/500px-Marant_arund_090103-5154_rwg.JPG",
            "metadata": {
                "Artist": "Wibowo Djatmiko (<a href=\"//commons.wikimedia.org/wiki/User:Wie146\" title=\"User:Wie146\">Wie146</a>)",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Melaleuca_leucadendron_flowers.jpg/500px-Melaleuca_leucadendron_flowers.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/w/index.php?title=User:Ethel_Aardvark&amp;action=edit&amp;redlink=1\" class=\"new\" title=\"User:Ethel Aardvark (page does not exist)\">Ethel Aardvark</a>",
                "LicenseShortName": "CC BY 3.0",
                "UsageTerms": "Creative Commons Attribution 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Pfefferminze_natur_peppermint.jpg/500px-Pfefferminze_natur_peppermint.jpg",
            "metadata": {
                "Artist": "Unknown",
                "LicenseShortName": "CC BY 3.0",
                "UsageTerms": "Creative Commons Attribution 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Gardenology.org-IMG_2751_rbgs11jan.jpg/500px-Gardenology.org-IMG_2751_rbgs11jan.jpg",
            "metadata": {
                "Artist": "Raffi Kojian",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Catnip_flowers.jpg/500px-Catnip_flowers.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Dger\" title=\"User:Dger\">D. Gordon E. Robertson</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Basil-Basilico-Ocimum_basilicum-albahaca.jpg/500px-Basil-Basilico-Ocimum_basilicum-albahaca.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Castielli\" title=\"User:Castielli\">Castielli</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/8/84/Olivesfromjordan.jpg",
            "metadata": {
                "Artist": "<a href=\"https://en.wikipedia.org/wiki/User:Nickfraser\" class=\"extiw\" title=\"en:User:Nickfraser\">en:User:Nickfraser</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Koehler1887-PimpinellaAnisum.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Piper_nigrum_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-107.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Grote_weegbree_bloeiwijze_Plantago_major_subsp._major.jpg/500px-Grote_weegbree_bloeiwijze_Plantago_major_subsp._major.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Rasbak\" title=\"User:Rasbak\">Rasbak</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Bistorta_officinalis_01.JPG/500px-Bistorta_officinalis_01.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Uoaei1\" title=\"User:Uoaei1\">Uoaei1</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Populus_%C3%97_jackii.jpg/500px-Populus_%C3%97_jackii.jpg",
            "metadata": {
                "Artist": "Philipp",
                "LicenseShortName": "CC0",
                "UsageTerms": "Creative Commons Zero, Public Domain Dedication",
                "LicenseUrl": "http://creativecommons.org/publicdomain/zero/1.0/deed.en",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Pomegranate_Juice_%282019%29.jpg/500px-Pomegranate_Juice_%282019%29.jpg",
            "metadata": {
                "Artist": "<b><a href=\"https://en.wikipedia.org/wiki/User:Mydreamsparrow\" class=\"extiw\" title=\"w:User:Mydreamsparrow\">Augustus Binu</a> : <a rel=\"nofollow\" class=\"external text\" href=\"https://www.flickr.com/photos/134573731@N04\">flickr</a></b>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Quercus_robur.jpg/500px-Quercus_robur.jpg",
            "metadata": {
                "Artist": "Wikipedia user - MPF",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Flowers_%282425723494%29_cropped.jpg/500px-Flowers_%282425723494%29_cropped.jpg",
            "metadata": {
                "Artist": "Michal Osmenda from Brussels, Belgium",
                "LicenseShortName": "CC BY-SA 2.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 2.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/2.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Solidago_virgaurea_minuta1.jpg/500px-Solidago_virgaurea_minuta1.jpg",
            "metadata": {
                "Artist": "Kurt Stüber <a rel=\"nofollow\" class=\"external autonumber\" href=\"http://www.kurtstueber.de/\">[1]</a>",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Kaldari_Stellaria_media_01.jpg/500px-Kaldari_Stellaria_media_01.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Kaldari\" title=\"User:Kaldari\">Kaldari</a>",
                "LicenseShortName": "CC0",
                "UsageTerms": "Creative Commons Zero, Public Domain Dedication",
                "LicenseUrl": "http://creativecommons.org/publicdomain/zero/1.0/deed.en",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Swertia_perennis_230705.jpg/500px-Swertia_perennis_230705.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:BerndH\" title=\"User:BerndH\">Bernd Haynold</a>",
                "LicenseShortName": "CC BY-SA 2.5",
                "UsageTerms": "Creative Commons Attribution-Share Alike 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Tamarindus_indica_pods.JPG/500px-Tamarindus_indica_pods.JPG",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:B.navez\" title=\"User:B.navez\">B.navez</a>",
                "LicenseShortName": "CC BY 2.5",
                "UsageTerms": "Creative Commons Attribution 2.5",
                "LicenseUrl": "https://creativecommons.org/licenses/by/2.5",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Thuja_occidentalis.jpg/500px-Thuja_occidentalis.jpg",
            "metadata": {
                "Artist": "Unknown",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Tilia_platyphyllos%2801%29.jpg/500px-Tilia_platyphyllos%2801%29.jpg",
            "metadata": {
                "Artist": "Georges Jansoone",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Violatricolorarvensis.jpg",
            "metadata": {
                "Artist": "<bdi><a href=\"https://en.wikipedia.org/wiki/en:Carl_Axel_Magnus_Lindman\" class=\"extiw\" title=\"w:en:Carl Axel Magnus Lindman\"><span title=\"Swedish botanist (1856-1928)\">Carl Axel Magnus Lindman</span></a>\n</bdi>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/4/40/Lavandula_angustifolia_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-087.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Mentha_piperita_-_Flickr_-_aspidoscelis_%281%29.jpg/1200px-Mentha_piperita_-_Flickr_-_aspidoscelis_%281%29.jpg",
            "metadata": {
                "Artist": "Patrick Alexander",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Augentrost.jpg/500px-Augentrost.jpg",
            "metadata": {
                "Artist": "Wikipedia user - Tigerente",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "http://creativecommons.org/licenses/by-sa/3.0/",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Cinnamomum_verum_spices.jpg/1199px-Cinnamomum_verum_spices.jpg",
            "metadata": {
                "Artist": "Simon A. Eugster",
                "LicenseShortName": "CC BY-SA 3.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 3.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/3.0",
                "AttributionRequired": "true"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/9/92/Agathosma_betulina_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-020.jpg",
            "metadata": {
                "Artist": "Franz Eugen Khler, <i>Khler's Medizinal-Pflanzen</i>",
                "LicenseShortName": "Public domain",
                "UsageTerms": "Public domain",
                "LicenseUrl": "Unknown",
                "AttributionRequired": "false"
            }
        },
        {
            "link": "https://www.welleum.com/wp-content/uploads/2020/01/DSC9728_1_x2500-e1578592774759-1200x1200.jpg",
            "metadata": {
                "Artist": "Unknown",
                "LicenseShortName": "Unknown",
                "UsageTerms": "Unknown",
                "LicenseUrl": "Source image from www.welleum.com",
                "AttributionRequired": "False"
            }
        },
        {
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Centella_asiatica_%28%E0%A6%A5%E0%A6%BE%E0%A6%A8%E0%A6%95%E0%A7%81%E0%A6%A8%E0%A6%BF%29_%283%29.jpg/500px-Centella_asiatica_%28%E0%A6%A5%E0%A6%BE%E0%A6%A8%E0%A6%95%E0%A7%81%E0%A6%A8%E0%A6%BF%29_%283%29.jpg",
            "metadata": {
                "Artist": "<a href=\"//commons.wikimedia.org/wiki/User:Shahidul_Hasan_Roman\" title=\"User:Shahidul Hasan Roman\">Shahidul Hasan Roman</a>",
                "LicenseShortName": "CC BY-SA 4.0",
                "UsageTerms": "Creative Commons Attribution-Share Alike 4.0",
                "LicenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
                "AttributionRequired": "true"
            }
        }
    ]
}